[
    {
        "id": "mit",
        "title": "MIT - MSCS Deadlines",
        "text": "MIT EECS\nElectrical\nEngineering\nComputer\nScience\nArtificial Intelligence +\nDecision-making\nContact\nEngage\nACADEMICS\nRESEARCH\nPEOPLE\nCOMMUNITY & EQUITY\nNEWS & EVENTS\nABOUT\nHOME\nACADEMICS\nGRADUATE PROGRAMS\nAdmission Process\nACADEMICS\nPast Terms' Subject Updates and WTW\nSubject numbering\nUndergraduate programs\ntoggle submenu\nGraduate Programs\ntoggle submenu\nGraduate Program Requirements\nAdmission Process\ntoggle submenu\nDegree Programs\nGraduate Research\nEECS Graduate Funding\ntoggle submenu\nResources for Current Students\nMaterials and Forms for Graduate Students\ntoggle submenu\nStudent Profiles\nSubject Updates\ntoggle submenu\nIAP offerings\ntoggle submenu\nThriving Stars helps answer the question, “What is a PhD degree and why do you want one?” Check out this story for a number of perspectives from EECS faculty leaders, EECS alumni and current graduate students working on their PhD degree: Thriving Stars tackles the question—what’s a PhD degree all about anyway??\nStudents tour a robotics lab in this photo taken by Pedro Colon Hernandez.\nThe EECS Department is the largest in the School of Engineering with about 700 graduate students in the doctoral program. [Application is for the doctoral program only — there is no terminal masters degree, but all PhD students earn a masters degree as they work towards PhD.  A Masters of Engineering is only available for qualified MIT EECS undergraduates.] \nThe application website (see link below) is available on September 15, 2024, for students who wish to apply for graduate admission in September 2025. The deadline for submitting completed applications is December 1, 2024.\nApplicants to the MIT EECS graduate program should apply using the EECS online admissions site. \nQuestions not answered by the FAQs? Send inquiries to grad-ap@eecs.mit.edu.\nNeed more information? Read this graduate admissions information letter.\nFor information on our faculty and what they’re currently working on, take a look at our Faculty Interests Guide.\nFor more information about writing a statement of objectives, see this article from the MIT EECS Communication Lab.\nMIT Electrical Engineering &\nComputer Science Department\n77 Massachusetts Ave.\nRoom 38-401\nCambridge, MA 02139\nEECS INTERNAL RESOURCES\nADMIN LOGIN\nACCESSIBILITY\nLinkedin\nFacebook\nTwitter\n© 2025 Massachusetts Institute of Technology",
        "tags": [
            "cs",
            "2025",
            "ms",
            "mit"
        ]
    },
    {
        "id": "stanford_university",
        "title": "Stanford University - MSCS Deadlines",
        "text": "Skip to main content\nSkip to secondary navigation\nStanford University\n(link is external)\nATTENTION 2025 CS GRADUATES\nImportant Note: For our 2025 CS Graduates, please read our CS Commencement Ceremony webpage for the most updated information. \nStanford\nENGINEERING\nComputer Science\nSearch this site\nSubmit Search\nHome\nAbout\nAcademics\nAdmissions\nResearch & Impact\nPeople\nGet Involved\nGraduate Application Deadlines\nSkip Secondary Navigation\nSecondary Navigation\nPhD Admissions\nMaster's Admissions\nCoterminal Admissions\nJoint Degree Admissions\nGraduate Application Checklists\nGraduate Application Deadlines\nCurrent Stanford Students\nNon-Degree Option\nStudent Resources\nContact Us\nMain content start\nOverview\nAll application deadlines are final. Applications will not be accepted after the deadline.\nWe have only one admissions cycle for starting in the Autumn quarter the PhD, MS (including HCP) program.\nImportant Note: For the joint degree programs, the application dates are only for the CS affiliated application. For the Graduate School of Business and School of Law application deadlines, please refer to the respective websites for additional information.\nFor the CS Coterminal program, you are only allowed to apply for a maximum of 3 attempts.\nProgram Entry quarter Application opens Application deadline Decision      \ndate\nPhD Application Autumn Late September TBD\nFebruary 2026\nMaster's Application Autumn Late September TBD\nMarch 2026\nCoterm Application (Stanford undergraduates only) Winter 2025-2026 September 23, 2025 October 7, 2025\nOctober 31, 2025\n  Spring 2025-2026 December 16, 2025 January 9, 2026\nFebruary 2, 2026\n  Autumn 2026-2027 April 10, 2026 May 1, 2026\nMay 29, 2026\nCS MS/MBA Application \n(CS MS deadline only) Autumn Late September TBD\nMarch 2026\nCS MS/Law Application \n(CS MS deadline only) Autumn Late September TBD\nMarch 2026\nCS PhD/Law Application \n(CS PhD deadline only) Autumn Late September TBD\nFebruary 2026\nKHS Deadline\nThe Knight-Hennessy Scholars (KHS) is a prestigious scholarship program. It is designed to build a multidisciplinary community of Stanford graduate students dedicated to finding creative solutions to the world's greatest challenges. KHS admits up to 100 high-achieving students every year from across Stanford's seven (7) graduate schools. Scholars receive up to three (3) years of full funding for graduate studies at Stanford. \n\nCandidates of any country may apply. KHS applicants must have earned their first undergraduate degree within the last seven years, and must apply to both a Stanford graduate program (MS or PhD) and to KHS. Learn More.\nThe application is now closed.\nTOEFL Deadline\nOctober 26, 2024 (at least six weeks before the application deadline) is the suggested deadline to ensure scores are received in time for review.\nCS Graduate Application\nApplicants to graduate studies in Computer Science must apply either to MS (including HCP) or PhD, not to both.\nApply Now\nCS Coterm Application\nApplicants to the CS Coterm program must be a current Stanford undergraduate. Students on leave of absence are not eligible to apply.\nApply Now\nThe CS Intranet: Resources for Faculty, Staff, and Current Students\nFor Faculty & Staff For Current CS Students\nIntranet\nWeb Login\nAddress\nGates Computer Science Building\n353 Jane Stanford Way\nStanford, CA 94305\nUnited States\nContact Us\nDirections to the Gates Building\nCampus Map\nFollow us on LinkedIn\nLinks to\nEvents\nNews from Stanford Engineering\nStanford Engineering Magazine\nStudent Resources\nCS IT Support\nCS Student Resources\nComputer Forum | Career Readiness\nComputing & Society\nEngineering Entrepreneurship Center\nSERIS Program\nTerman Engineering Library\nStanford\nUniversity\n(link is external)\nStanford Home\n(link is external)\nMaps & Directions\n(link is external)\nSearch Stanford\n(link is external)\nEmergency Info\n(link is external)\nTerms of Use\n(link is external)\nPrivacy\n(link is external)\nCopyright\n(link is external)\nTrademarks\n(link is external)\nNon-Discrimination\n(link is external)\nAccessibility\n(link is external)\n© Stanford University.   Stanford, California 94305.",
        "tags": [
            "cs",
            "2025",
            "ms",
            "stanford_university"
        ]
    },
    {
        "id": "carnegie_mellon_university",
        "title": "Carnegie Mellon University - MSCS Deadlines",
        "text": "EDUCATION\nRESEARCH\nNEWS & EVENTS\nABOUT SCS\nPARTNERSHIPS\nDEPARTMENTS\nGIVE\nApply to the School of Computer Science Graduate Programs\nThe School of Computer Science offers a number of academic and professional Ph.D. and Master's programs.\nDescriptions of the programs can be found on our Doctoral and Master's programs pages.\n\nThis online application contains most of the SCS Graduate Programs.\n\nOther program applications:\nApply to the Master of Human-Computer Interaction (MHCI) program\nApply to the Dual Degree Ph.D. Portugal programs\n\nFor more information about our application please see the SCS Graduate Admissions page.\nOur application opens on September 3, 2025 for Fall 2026 Admissions. \n\nApplication Deadlines:\nEarly Deadline: November 19, 2025 (3 p.m. EST)\nFinal Deadline: December 10, 2025 (3 p.m. EST)\n\nApplication Fee:\nEarly Deadline: $80 per program\nFinal Deadline: $100 per program\nNote: The MSE programs do not follow an early deadline and the application fee is $100.\nNote: Some programs may choose to waive the application fee.\nInformation about fee waivers will be displayed when you select a program during the application process.\n\nTOEFL, IELTS, & GRE Deadlines:\nIf you need to take/retake your TOEFL, IELTS and/or GRE for this application, we highly recommend you\ntake the exam no later than November 26, 2025. Reportable scores can take two weeks to process\nand we may not be able to review any scores that arrive after our December 10, 2025 deadline.\nExisting accounts login\nSchool of Computer Science\n5000 Forbes Avenue\nPittsburgh, PA 15213\nLegal Info | scs-grad-application@andrew.cmu.edu\n© Carnegie Mellon University 2025\nQatar Campus\nSilicon Valley Campus",
        "tags": [
            "cs",
            "2025",
            "ms",
            "carnegie_mellon_university"
        ]
    },
    {
        "id": "uc_berkeley",
        "title": "UC Berkeley - MSCS Deadlines",
        "text": "Skip to content\nStudent Resources Staff Resources\n(opens in a new tab)\nNews & Events\nApply Now\nAbout\nAdmissions\nFinancial Support\nAcademics\nProfessional Development\nDiversity\nGiving\nToggle Search\nElectrical Engineering & Computer Sciences\nComputer Science MS\nBack to All Programs\nOverview\nThe Department of Electrical Engineering and Computer Sciences (EECS) offers two graduate programs in Computer Science: the Master of Science (MS), and the Doctor of Philosophy (PhD).\nMaster of Science (MS)\nThe Master of Science (MS) emphasizes research preparation and experience and, for most students, is a chance to lay the groundwork for pursuing a PhD.\nDoctor of Philosophy (PhD)\nThe Berkeley PhD in EECS combines coursework and original research with some of the finest EECS faculty in the US, preparing for careers in academia or industry. Our alumni\n(opens in a new tab)\nhave gone on to hold amazing positions around the world.\nContact Info\ngradadmissions@eecs.berkeley.edu\n\n215 Cory Hall\nBerkeley, CA 94720\nProgram Website\n(opens in a new tab)\nAt a Glance\nDepartment(s)\nElectrical Engineering & Computer Sciences\nAdmit Term(s)\nFall\nApplication Deadline\nDecember 9, 2024\nDegree Type(s)\nMasters / Professional\nDegree Awarded\nM.S.\nGRE Requirements\nOptional\nGraduate Division\nContact the Graduate Division\nWorkshops and Events\nGraduate Publications\nOrganizational Chart (PDF)\nOur Sites\nGSI Teaching & Resource Center\n(opens in a new tab)\nBerkeley Graduate Lectures\n(opens in a new tab)\nTanner Lectures\n(opens in a new tab)\nBack-Up Child Care\n(opens in a new tab)\nGraduate Mentoring Awards\n(opens in a new tab)\nSMART Mentoring\n(opens in a new tab)\nGrad Dashboard (for Faculty & Staff)\n(opens in a new tab)\nOur Mission\nThe Graduate Division oversees graduate admissions, fellowships, grants, academic employment, preparation for teaching, mentoring activities, professional development, academic progress and degree milestones.\nCan’t find something?\nGive Feedback\n(opens in a new tab)\nLearn more about the Campaign for Berkeley and Graduate Fellowships.\nSupport Graduate Division\nGraduate Division on Twitter\n(opens in a new tab)\nGraduate Division on LinkedIn\n(opens in a new tab)\nGraduate Division on Instagram\n(opens in a new tab)\nPrivacy\nNondiscrimination\n(opens in a new tab)\nAccessibility\n(opens in a new tab)\nCopyright © 2025 UC Regents",
        "tags": [
            "cs",
            "2025",
            "ms",
            "uc_berkeley"
        ]
    },
    {
        "id": "princeton_university",
        "title": "Princeton University - MSCS Deadlines",
        "text": "Graduate School\nSkip to content\nSkip to search\nMain Menu\nAdmission & Onboarding\nAdmission & OnboardingSubmenu\nAcademics\n, (current section)\nAcademicsSubmenu\nFinancial Support\nFinancial SupportSubmenu\nProfessional Development\nProfessional DevelopmentSubmenu\nDiversity\n(Link is external) (Link opens in new window)\nStudent Experience\nStudent ExperienceSubmenu\nAlumni\nAbout\nAboutSubMenu\nHooding/Commencement\nNews\nEvents\nPolicies\nAdmin Portal\n(Link is external)\nAPPLY\nLog in\nSearch\nHome\nAcademics\nGraduate Degrees & Requirements\nFields of Study\nComputer Science\nAcademic Year 2024 – 2025\nJUMP TO:\nOverview\nApply\nProgram Offerings\nFaculty\nPermanent Courses\nGeneral Information\nAddress\nComputer Science Building, 35 Olden Street\nPhone\n609-258-5387\n(Link opens phone app)\nWebsite\nDepartment of Computer Science\n(Link is external)\nProgram Offerings:\nPh.D.\nM.S.E.\nGraduate Program Administrator:\nNicki Mahler\n(Link sends email)\nLouis Riehl\n(Link sends email)\nDirector of Graduate Studies:\nKyle Jamieson\n(Link sends email)\nAarti Gupta\n(Link sends email)\nOverview\nThe Department of Computer Science accepts both beginning and advanced graduate students for study and research leading to the degree of Master of Science in Engineering (M.S.E.) and Doctor of Philosophy (Ph.D.). These degree programs are sufficiently flexible to adapt to individual plans of study and research.\nApply\nApplication deadline\nDecember 15, 11:59 p.m. Eastern Standard Time (This deadline is for applications for enrollment beginning in fall 2025)\nProgram length\nPh.D. 5 years, M.S.E. 2 years\nFee\n$75\nGRE\nGeneral Test - not accepted\nAdditional departmental requirements\nProgram Offerings\nPh.D.\nM.S.E.\nProgram description\nThe doctoral program in computer science combines coursework and participation in original research. Most students enter the program with an undergraduate degree in computer science, mathematics, or a related discipline. Some entering students may have a master’s degree, but that is not necessary for success in the program. Every admitted Ph.D. student is given financial support in the form of a first-year fellowship. In addition, all admitted Ph.D. students are automatically considered for the prestigious Wu and Upton Fellowships.\nCourses\nIn preparation for the general examination, the doctoral candidate, in consultation with a faculty adviser, develops an integrated program of study in one of the departmental areas of research. Such preparation usually requires two academic years for students entering with a bachelor’s degree, and one year for students entering with a master’s. Students are required to stand for the general examination at the end of the second year.\nA total of 6 courses are required. Three courses must be taken to satisfy the core breadth requirement, with one course from each of three main areas of computer science: Systems, Artificial Intelligence (AI), and Theory.  All students must fulfill the core breadth requirements plus one additional course by the end of the second year, demonstrating minimum competence in three main areas. The remaining three courses can be any 400- or 500-level course from any department in the University. Courses taken outside the Department of Computer Science require approval from the student’s academic adviser and the Director of Graduate Studies.\nAll courses must be taken for a grade. A grade of B+ or higher is required to get credit towards course requirements, although at most one B will be accepted for a course that does not satisfy the core breadth requirements. Individual research areas may request additional courses in excess of departmental requirements or may require students in that subfield to complete specific required courses in fulfillment of course requirements.\nBreadth requirement core course list:\nArtificial Intelligence\n511 Theoretical Machine Learning\n513 Foundations of Probabilistic Modeling\n514 Fundamentals of Deep Learning\n524 Fundamentals of Machine Learning\n529 Advanced Computer Vision\n584 Advanced Natural Language Processing\nSystems\n475 Computer Architecture (See ELE 475)\n518 Advanced Computer Systems\n561 Advanced Computer Networks\n563 Wireless Networks\nTheory\n510 Program Languages\n516 Automated Reasoning About Software\n521 Advanced Algorithm Design\n522 Computational Complexity\n585 Information Theory and Applications\nGeneral exam\nThe general examination consists of a research seminar prepared under the supervision of a faculty member, followed by an in-depth oral examination on the contents of the seminar and the associated general area of research. The oral examination tests the student's knowledge in a number of topics relevant to the student's research area. These topics are specified beforehand by an examining committee in consultation with the student. The seminar is open to the public, and at least three computer science faculty members must attend. Two are invited by the student; the adviser chooses a  third faculty member who could be in any area of Computer Science or related fields.  The examining committee and the student agree upon a reading list for the exam. This document is to be made available to anyone present in the oral examination, and only questions pertaining to either the material described in the document or presented during the research seminar can be asked during the oral examination.\nOriginal research results do not have to be presented, but problems whose solution may lead to a thesis should be discussed. In many cases, the student’s thesis is in the same area as the research seminar, but this is not required.\nQualifying for the M.A.\nThe Master of Arts (M.A.) degree is normally an incidental degree on the way to full Ph.D. candidacy once a student has successfully completed the general examination. The M.A. may also be awarded to students who, for various reasons, leave the Ph.D. program, provided the student has successfully completed the six required courses from the Breadth Requirement. Please note, students admitted to the Ph.D. program who do not wish to complete the program may be considered for an M.S.E. degree with approval from the department and the Graduate School. Ph.D. students who have already been awarded the incidental M.A. are not eligible to earn an M.S.E.\nFor students who entered the Ph.D. Program before Fall 2018: The Master of Arts degree can be awarded after successfully completing all the year 2 requirements -- 3 core courses, one additional course, and passing the general exam.  \nFor students who entered the Ph.D. Program Fall 2018 and after: The Master of Arts degree can be awarded after successfully completing the 6 required courses from the Breadth Requirements.\nTeaching\nTeaching experience is considered to be a significant part of graduate education. All Ph.D. candidates are therefore required to assist with course instruction for the equivalent of two terms.\nPost-Generals requirements\nPre-FPO\nThe preliminary FPO is a research talk given to the anticipated FPO committee approximately six months before the FPO date. The pre-FPO covers results to date and planned research, and serves as a preliminary critique of the proposed dissertation. \nGraduate students will present a public talk followed by a private meeting with the committee.  The outcome of the pre-FPO is not graded. Graduate students are provided with valuable feedback to the committee expects will guide any final work and will be incorporated into the dissertation.\nFPO Committee must be identical to the Pre-FPO committee; any subsequent changes to the committee require approval from the DGS.\nDissertation and FPO\nThe Ph.D. is awarded after the acceptance of the dissertation and completion of the final public oral.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFaculty\nChair\nSzymon M. Rusinkiewicz\nAssociate Chair\nRyan P. Adams\nWyatt A. Lloyd\nDirector of Graduate Studies\nAarti Gupta (co-director)\nKyle A. Jamieson (co-director)\nDirector of Undergraduate Studies\nBrian W. Kernighan (co-director)\nKevin Wayne (co-director)\nProfessor\nRyan P. Adams\nAndrew W. Appel\nSanjeev Arora\nDavid I. August\nMark Braverman\nBernard Chazelle\nZeev Dvir\nAdam Finkelstein\nMichael J. Freedman\nTom Griffiths\nAarti Gupta\nElad Hazan\nKyle A. Jamieson\nBrian W. Kernighan\nKai Li\nMargaret R. Martonosi\nRadhika Nagpal\nArvind Narayanan\nBen Raphael\nRan Raz\nJennifer Rexford\nSzymon M. Rusinkiewicz\nH. Sebastian Seung\nJaswinder P. Singh\nMona Singh\nRobert E. Tarjan\nOlga G. Troyanskaya\nDavid P. Walker\nAssociate Professor\nJia Deng\nZachary Kincaid\nGillat Kol\nWyatt A. Lloyd\nJonathan Mayer\nKarthik Narasimhan\nRavi A. Netravali\nOlga Russakovsky\nMatt Weinberg\nAssistant Professor\nParastoo Abtahi\nDanqi Chen\nTri Dao\nAdji Bousso Dieng\nBenjamin Eysenbach\nFelix Heide\nPeter Henderson\nManoel Horta Ribeiro\nAleksandra Korolova\nPravesh K. Kothari\nAmit A. Levy\nLydia T. Liu\nAlex Lombardi\nMae Milano\nAndrés Monroy-Hernández\nYuri Pritykin\nHuacheng Yu\nEllen Zhong\nAssociated Faculty\nAmir Ali Ahmadi, Oper Res and Financial Eng\nChristine Allen-Blanchette, Mechanical & Aerospace Eng\nMaria Apostolaki, Electrical & Comp Engineering\nJianqing Fan, Oper Res and Financial Eng\nJaime Fernandez Fisac, Electrical & Comp Engineering\nYasaman Ghasempour, Electrical & Comp Engineering\nChi Jin, Electrical & Comp Engineering\nJason D. Lee, Electrical & Comp Engineering\nAnirudha Majumdar, Mechanical & Aerospace Eng\nPrateek Mittal, Electrical & Comp Engineering\nPaul Seymour, Mathematics\nJohn D. Storey, Integrative Genomics\nDaniel L. Trueman, Music\nJanet A. Vertesi, Sociology\nPramod Viswanath, Electrical & Comp Engineering\nMengdi Wang, Electrical & Comp Engineering\nDavid Wentzlaff, Electrical & Comp Engineering\nUniversity Lecturer\nKevin Wayne\nSenior Lecturer\nRobert M. Dondero\nRobert S. Fish\nAlan Kaplan\nXiaoyan Li\nChristopher M. Moretti\nLecturer\nSebastian Caldas\nMarcel Dall'Agnol\nRuth C. Fong\nDonna S. Gabai\nMihir E. Kshirsagar\nPedro Paredes\nIasonas Petras\nVikram V. Ramaswamy\nVisiting Lecturer\nCorey M. Sanders\nFor a full list of faculty members and fellows please visit the department or program website.\nPermanent Courses\nCourses listed below are graduate-level courses that have been approved by the program’s faculty as well as the Curriculum Subcommittee of the Faculty Committee on the Graduate School as permanent course offerings. Permanent courses may be offered by the department or program on an ongoing basis, depending on curricular needs, scheduling requirements, and student interest. Not listed below are undergraduate courses and one-time-only graduate courses, which may be found for a specific term through the Registrar’s website. Also not listed are graduate-level independent reading and research courses, which may be approved by the Graduate School for individual students.\nCEE 520 - Advanced Topics in Network Science (also COS 520/SML 520)\nCOS 510 - Programming Languages\nCOS 511 - Theoretical Machine Learning\nCOS 513 - Foundations of Probabilistic Modeling (also SML 513)\nCOS 514 - Fundamentals of Deep Learning\nCOS 516 - Automated Reasoning about Software (also ECE 516)\nCOS 518 - Advanced Computer Systems\nCOS 521 - Advanced Algorithm Design\nCOS 522 - Computational Complexity (also MAT 578)\nCOS 524 - Fundamentals of Machine Learning\nCOS 526 - Neural Rendering (also ECE 576)\nCOS 528 - Data Structures and Graph Algorithms\nCOS 529 - Advanced Computer Vision\nCOS 532 - Computer Graphics: Modeling\nCOS 533 - Cryptography\nCOS 534 - Fairness in Machine Learning\nCOS 551 - Introduction to Genomics and Computational Molecular Biology (also MOL 551/QCB 551)\nCOS 557 - Artificial Intelligence for Precision Health (also QCB 557)\nCOS 561 - Advanced Computer Networks\nCOS 563 - Wireless Networks\nCOS 568 - Systems and Machine Learning\nCOS 583 - Great Moments in Computing (also ECE 583)\nCOS 584 - Advanced Natural Language Processing\nCOS 585 - Information Theory and Applications\nCOS 589 - Extramural Summer Research Project\nCOS 590 - Extramural Research Internship\nCOS 597A - Advanced Topics in Computer Science\nCOS 597B - Advanced Topics in Computer Science\nCOS 597C - Advanced Topics in Computer Science\nCOS 597D - Advanced Topics in Computer Science\nCOS 597E - Advanced Topics in Computer Science\nCOS 597F - Advanced Topics in Computer Science\nCOS 597G - Advanced Topics in Computer Science\nCOS 597H - Advanced Topics in Computer Science\nCOS 597I - Advanced Topics in Computer Science\nCOS 597J - Advanced Topics in Computer Science\nCOS 597K - Advanced Topics in Computer Science\nCOS 597M - Advanced Topics in Computer Science\nCOS 597N - Advanced Topics in Computer Science\nCOS 597O - Advanced Topics in Computer Science\nCOS 597Q - Advanced Topics in Computer Science\nCOS 597R - Advanced Topics in Computer Science\nCOS 597S - Advanced Topics in Computer Science\nCOS 597T - Advanced Topics in Computer Science\nCOS 597U - Advanced Topics in Computer Science\nCOS 598 - Advanced Topics in Computer Science\nCOS 598A - Advanced Topics in Computer Science\nCOS 598B - Advanced Topics in Computer Science\nCOS 598C - Advanced Topics in Computer Science\nCOS 598D - Advanced Topics in Computer Science\nCOS 598I - Advanced Topics in Computer Science\nCOS 598K - Advanced Topics in Computer Science\nCOS 598L - Advanced Topics in Computer Science\nECE 532 - Safety-Critical Robotics and AI (also COS 572/MAE 572/ROB 532)\nECE 539 - Special Topics in Data and Information Science (also COS 512)\nECE 539B - Special Topics in Information Sciences and Systems (also COS 597P)\nECE 580 - Advanced Topics in Computer Engineering (also COS 597V)\nSOC 555 - Limits to Prediction (also COS 598J)\nSPI 586F - Topics in STEP (also COS 586)\nFOOTER\nPrinceton University Graduate School\nClio Hall, Princeton, NJ, 08544\nContact: gs@princeton.edu\nAccessibility Guides: Clio Hall and University Buildings\nX\n(Link is external)\nFacebook\n(Link is external)\nInstagram\n(Link is external)\nLinkedIn\n(Link is external)\nDiversity & Non-Discrimination\n(Link is external)\nAccessibility Help\n(Link is external)\n© 2025 The Trustees of Princeton University",
        "tags": [
            "cs",
            "2025",
            "ms",
            "princeton_university"
        ]
    },
    {
        "id": "harvard_university",
        "title": "Harvard University - MSCS Deadlines",
        "text": "Skip to main content\nUtility Menu\nPrograms\nFinancial Aid\nNews\nAbout\nUtility Button Menu\nGet Help\nApply\nDonate\nMenu\nApply\nGet started with your application to the Harvard Kenneth C. Griffin Graduate School of Arts and Sciences (Harvard Griffin GSAS)\nApply\nApplying to Degree Programs\nApplying to the Visiting Students Program\nAdmissions Policies\nCost of Attendance\nExpress Interest\nCampus Safety\nWelcome! \nAccess the applicant portal\nWe’re delighted that you are interested in pursuing academic studies at the Harvard Kenneth C. Griffin Graduate School of Arts and Sciences (Harvard Griffin GSAS). Whether you intend to study toward a master’s or PhD degree, join a visiting students program, or participate in one of our outreach programs, we are looking forward to reviewing your application. For information about tuition and fees, see the Cost of Attendance section.\nHarvard does not discriminate on the basis of race, color, sex, sexual orientation, gender identity, religion, age, national origin, ancestry, political beliefs, veteran status, disability or any other protected classification, and we actively seek applicants from historically underrepresented communities. We hope you’ll consider applying. \nImmigration status does not factor into decisions about admissions and financial aid. For more information, see Undocumented at Harvard. \nGet Started \nStep 1: Choose a program. \nYou have several options for study at Harvard Griffin GSAS. \nDegree Programs \nThe school offers master’s and PhD degrees in programs based in the arts and humanities, social sciences, natural sciences, and engineering and applied sciences. Many programs also allow a student to conduct more focused research by choosing an area of study. Review the programs on offer to decide which program best meets your academic goals. \nAre you a Harvard College student looking for information on the AB/AM and AB/SM programs? Visit the Harvard AB/AM and AB/SM programs page.\nNon-Degree Programs \nThe Visiting Students Program offers you the opportunity to take classes and conduct research with faculty. \nOutreach Programs \nIf you are looking for a short-term research experience, consider a paid summer internship organized by Harvard Griffin GSAS, Harvard departments, and Harvard-affiliated teaching hospitals. The School also offers Research Scholar Initiative, a post-baccalaureate program that enables college graduates to take part in a long-term research experience. \nInformation for Exchange Scholars:\nExchange Scholars \nStep 2: Make a note of the application deadline and review admissions policies.\nApplication deadlines vary by program and are noted on the relevant program page. You should also review our admissions policies and Applying to Degree Programs.\nStep 3: Determine whether you need to take standardized tests and register early. \nDegree programs may require Graduate Record Examination (GRE) general test or subject test scores. Applicants who are non-native English speakers may be required to demonstrate English proficiency by submitting scores from an English Language test (TOEFL or IELTS). Review the admissions policy on English proficiency for more information.  \nStep 4: Complete your application by the deadline. \nThe degree program application becomes available in September. You should review Applying to Degree Programs before starting your application. All components of the application to a degree program are due by 5:00 p.m., Eastern Time, on the deadline date.\nApplications for the Visiting Students Program are accepted twice a year.\nFor application information about our Outreach Programs, visit your program page of interest.  \nWho should I contact if I have a question about a specific program? \nIf you still have questions after carefully reviewing your degree program of interest, reach out to the contact noted on the program’s page. \nCan I enroll in courses instead of applying to a degree program? \nIf you are interested in taking courses for academic credit outside of a formal degree program, you may apply for Visiting Student status by the appropriate deadline. Please visit the Visiting Students website or contact gsasvisitingstudent@fas.harvard.edu to learn more. \nHarvard Integrated Life Sciences (HILS) Applicants \nWhile prospective degree program applicants are encouraged to carefully choose the HILS program that best fits their academic goals, interested applicants may apply to up to three programs and pay only one application fee. If you elect to apply to three programs, only two may be programs in the Department of Medical Sciences (these programs are biomedical informatics, biological and biomedical sciences, immunology, neuroscience, speech and hearing bioscience and technology, and virology). The fee waiver for additional applications is ONLY available for those applying to multiple programs in the HILS federation. For more information, please consult the HILS page. \nCONTACT\nAdmissions\nAddress\nRichard A. and Susan F. Smith Campus Center\n1350 Massachusetts Avenue, Suite 350\nCambridge, MA 02138\nEmail\nadmiss@fas.harvard.edu\nPhone\n617-495-5315\nSHARE\nFacebook\nTwitter\nLinkedIn\nEmail\nEVENTS CALENDAR\nExplore Events\nView All Events\nView Academic Calendar\nThe Harvard Kenneth C. Griffin Graduate School of Arts and Sciences is a leading institution of graduate study, offering PhD and select master’s degrees as well as opportunities to study without pursuing a degree as a visiting student.\nHarvard University\nRichard A. and Susan F. Smith Campus Center\n1350 Massachusetts Avenue, Suite 350\nCambridge, MA 02138-3654\nContact\nTel: 617-495-5315\nFax: 617-495-2928\nEmail: gsas@fas.harvard.edu\nAdditional Resources\nPrivacy\nAccessibility\nDigital Accessibility\nReport Copyright Infringement\nMap\n© 2025 The President and Fellows of Harvard College\nMain Menu Social\nInstagram\nLinkedIn\nThreads\nTikTok\nFacebook\nYouTube",
        "tags": [
            "cs",
            "2025",
            "ms",
            "harvard_university"
        ]
    },
    {
        "id": "caltech",
        "title": "Caltech - MSCS Deadlines",
        "text": "skip to main content\nPositions Available\nDivision of Engineering and Applied Science\nComputing + Mathematical Sciences\nDivision of Engineering and Applied Science\nAbout\nOpen About submenu\nPeople\nOpen People submenu\nAcademics\nOpen Academics submenu\nResearch\nOpen Research submenu\nNews & Events\nOpen News & Events submenu\nContact Us\nHome  /  Academics  /  Graduate Programs  /  Graduate Degree in Computer Science\nGraduate Degree in Computer Science\nACADEMICS\nGraduate Programs\nGraduate Degree in Applied + Computational Mathematics\nGraduate Degree in Computer Science\nGraduate Degree in Computing + Mathematical Sciences\nGraduate Degree in Control + Dynamical Systems\nGraduate Subject Minors\nUndergraduate Programs\nCourses\nCourse Schedule\nHonors and Awards\nGraduate study in computer science within the Computing & Mathematical Sciences department is oriented principally toward Ph.D. research. The Ph.D. program requires a minimum of three academic years of residence; required coursework is generally completed within the first two years. Students must maintain high academic standards during their graduate residence. A student's Ph.D. research must exhibit originality in the formulation, analysis, and solution of a problem that is significant to the field of study. The option representative and executive officers are available to discuss concerns regarding academic progress.\nComputation is now pervasive, wide-reaching, and unavoidable in our daily lives, and in science and engineering. The Computer Science option gives students a strong grounding in the mathematical and algorithmic foundations of computing, provides an introduction to cutting-edge research in a variety of subfields of Computer Science, and prepares them to apply computational thinking to a diversity of applications in Computer Science and beyond. Our students and faculty strive to:\nunderstand information and computation as intrinsic components of a broad array of natural and engineered systems\ntackle challenging and fundamental problems with the potential for long-term and real-world impact\ndevelop underlying theory\nnurture collaboration between traditionally separate disciplines\nThe graduate computer science option is primarily oriented toward Ph.D. research. Students complete advanced coursework to achieve a breadth of knowledge in the core areas of computer science, and specialized coursework in their intended research area as directed by their research advisor and the graduate option representative. The M.S. degree entails a thesis and coursework and is normally awarded in the first two years as part of the overall progress toward the Ph.D.\nThe department expects Ph.D. students to achieve:\na thorough understanding of the mathematical and algorithmic foundations of computer science,\ncutting-edge knowledge in the area of research specialization,\nthe ability to identify, formulate, and tackle problems at the research frontiers in the area of specialization,\nsuccess and originality in the formulation, analysis, and solution of a problem that is significant to the area of research specialization,\nexperience in critically evaluating computer science research,\nexperience in effectively communicate their ideas in writing and in oral presentations.\nGraduate Program Details and Requirements\nRequirements for the Computer Science graduate program are listed in the current Caltech Catalog.\nFurther details and advice can be found here: Navigating the Ph.D. Options in CMS\nGraduate Options Administrator\nMaria Lopez\nmlopez@cms.caltech.edu\n(626) 395-3034\nGraduate Option Representative\nLeonard Schulman\nComputer Science Option Representative\nCalifornia Institute of Technology\n1200 East California Boulevard\nPasadena, California 91125\nCommunity Portal\n|\nDigital Accessibility\n|\nPrivacy Notice\n|\nSite Content Copyright © 2025\n|\nLog In",
        "tags": [
            "cs",
            "2025",
            "ms",
            "caltech"
        ]
    },
    {
        "id": "cornell_university",
        "title": "Cornell University - MSCS Deadlines",
        "text": "Skip to Content\nABOUT\nEVENTS\nPEOPLE\nCOURSES\nRESEARCH\nUNDERGRADUATE\nM ENG\nMS\nPHD\nThe Application Process\nYou are here\nHOME < M ENG < ADMISSIONS\nDeadlines\nApplications for the Master of Engineering Program in Computer Science are accepted for both the fall and spring terms. All application materials must be received by:\nOctober 1st ( for Spring admissions - January start )\nFebruary 1st ( for Fall admissions - August start )\n*We do not process applications received after the above deadlines. If you have extenuating circumstances that prevent you from applying on time and would like to request approval for submitting your application late, please contact meng-admissions@cs.cornell.edu. Our decision to approve or disapprove a late submission will depend on how far past the deadline you wish to submit your application, the reason for the late submission, and whether we have completed our application review.\nRequired Materials\nAll application material must be submitted through our online application system. No exceptions will be made.\nClick HERE to establish an online application account for the CS MEng program at Cornell Ithaca.\nThe application requires:\nLetters of Recommendation (two letters required.)\nRecent graduates and current students should try to provide at least one recommendation from an instructor, professor or another academic contact.\nCurrent Cornell Computer Science students need only one LOR. Please enter a \"filler\" for the second contact.\nIt is also acceptable to provide LORs from intern/employment supervisors, team leads, and managers.\nLetters should be submitted only through the online application system.\nPlease DO NOT check the \"Letter will be mailed\" box as this prevents the system from sending a request out to the reference \nIf you choose to use the Interfolio service: Interfolio assigns a \"custom document e-mail address\" to each letter, which gets used IN PLACE OF the recommender's e-mail address on the ApplyWeb application. To find this custom document e-mail address, open your Interfolio account, click on the name of your letter/document, copy the email address, and paste that into your ApplyWeb application (in place of the recommender's personal e-mail address). More information can be found here: http://www.interfolio.com/online-application-deliveries/\nStatement of Purpose.\nIdentify areas of computer science that are of particular interest and explain why.\nExplain why you are interested in the CS MEng Program at Cornell University.\nReview what makes you qualified for our program.\nDiscuss how the CS MEng program will help you meet your future goals.\nPersonal Statement\nYour Personal Statement should provide the admissions committee with a sense of you as a whole person, and you should use it to describe how your background and experiences influenced your decision to pursue a graduate degree.\nAdditionally, it should provide insight into your potential to contribute to a community of inclusion, belonging, and respect where scholars representing diverse backgrounds, perspectives, abilities, and experiences can learn and work productively and positively together.\nWe recommend using this space to explicitly describe any obstacles you have overcome in your life's journey and how you overcame these obstacles and persevered to reach your goals.\nTranscripts of all college-level work. Scan each transcript and upload it into the online application system or upload digital versions. The transcript must be legible and oriented correctly.\nSome secure digital transcripts are not legible once uploaded.  Please make sure your transcripts can be shared as an upload before submitting your application.\nUpload transcripts after grades from your most recently completed semester/term are posted. You will want the admissions committee to see your most recent grades.\nBefore matriculation, you will be asked to have an official electronic version of each transcript sent to the Graduate School records office. Additional information is available here: https://gradschool.cornell.edu/admissions/application-steps/transcripts/\nCornell undergraduates will not be required to follow this step.\nInternational students, please visit the Grad School application information webpage for additional information on transcript requirements.\nIMPORTANT: Hard Copies of Transcripts should NOT be mailed to the CS Department.\nGRE Scores are no longer required as part of an application to the CS M.Eng Program. \nSubmitting scores will have no impact on the admission committee's decision.\nApplication Fee waivers are not offered by the CS M.Eng Office. We do not offer financial aid and therefore do not offer application fee waivers. The only exception is for those who might be applying for the CS M.Eng Diversity Scholarship. Candidates for the scholarship needing an application fee waiver should contact meng-admissions@cs.cornell.edu \n  PROOF ENGLISH LANGUAGE PROFICIENCY: All International students who earned their degrees from institutions in a country where English is not the official language and do not meet one of the standard exemptions outlined on the Cornell Graduate Admissions webpages are required to submit scores from either the TOEFL or IELTS tests.\nTOEFL: The Graduate School mandates that applicants meet the following minimum scores in order to be considered for admission: Writing (>=20), Listening (>=15), Reading (>=20), and Speaking (>=22).\nCS MEng requires that applicants meet the above section minimums. Most admitted applicants have exceeded the minimum.\nScores should be sent directly by the testing service to Cornell University Graduate School (institution code 2098) Department code is not required. Additional information on TOEFL requirements is provided by the Graduate School\nIELTS: is also accepted as a test of English Language Proficiency. An overall band score of 7/0 or higher is required. \nPlease see information about English Language Proficiency Requirements on the Graduate Admissions webpages including how to send  IELTS scores, exemptions, and timelines.\nNo tests other than IELTS and TOEFL are accepted as proof of English Language Proficiency at this time. If additional tests are added, the information will be available on the Graduate Admissions web pages. \nAdditional information about your application:\nPlease do not send/provide any materials which are not specified as required for your application. No additional documents will be considered during the review unless prior permission has been granted.\nA writing sample is not required.\nHard copies of application materials already submitted online are not required. Do not send a printed copy of your application.\nNo application materials should be mailed. All materials should be submitted through the application system.\nQuestions about the required application materials? e-mail CS M.Eng Admissions\nM ENG\nAdmissions\nThe Review Process\nEarly M.Eng Credit Approval\nFinancial Aid\nFAQ\nPrerequisites\nThe Application Process\nAcademics\nCurrent Students\nEntrepreneurship\nCornell Tech Programs\nProfessional Development\nGraduation Information\nContact MEng Office\nCareer Success\nNetID Login (internal use only)\n© 2025 Cornell University\n402 Gates Hall, Cornell University, Ithaca, NY 14853\nSubscribe on Youtube\nFollow us on X\nLike us on Facebook\nFollow us on Instagram\nIf you have a disability and are having trouble accessing information on this website or need materials in an alternate format, contact web-accessibility@cornell.edu for assistance.",
        "tags": [
            "cs",
            "2025",
            "ms",
            "cornell_university"
        ]
    },
    {
        "id": "ucla",
        "title": "UCLA - MSCS Deadlines",
        "text": "Skip to content\nSAMUELI\nABOUT\nNEWS & EVENTS\nACADEMICS\nRESEARCH\nPEOPLE\nGraduate Admissions\nFrequently Asked Questions\nFrequently Asked Questions\nDue to the high volume of email inquiries, applicants will not receive a personalized response. Over the last few years, we have found that for 99% of the responses to these inquiries can be found on this FAQ admission webpage. Most questions can be answered by simply reviewing or searching a topic, such as GRE, TOEFL, official transcripts, personal statement and document status.\nIn the rare instance when a question is not answered on one of the above webpages or in the general response below, a personalized email response may be provided. As noted in the above webpages, applicants are asked not to make email or phone inquiries about the receipt of documents. Doing so will delay our efforts to process application material.\nApplication/Admission Requirements and Data\nHow do I apply?\nDoes the department provide “pre-application” reviews?\nWhat are the application requirements?\nDo you accept applications for admission for study beginning winter or spring quarter?\nHow many applications do you receive, and how many students were admitted?\n\nMy academic background is not in Computer Science. Am I eligible to apply to your graduate program? What are the prerequisites?\nWill my application be reviewed if any application material is submitted after December 15?\nHow can I apply for a Fee Waiver?\nAre “conditional admission” offers made to applicants?\nIs a transitional or pre-master’s program offered?\nMay I apply to the M.S. program if I already have earned or will soon earn a master’s degree?\nIf I am in my last year of my bachelor's degree program, am I eligible to apply?\nApplication/Admission/Document Status\nHave you received my transcripts (or GRE, TOEFL)?\nWill my application and application material(s) be reviewed if I submit it after December 15?\nWhen will I be informed of my admission status?\nIf I am admitted, may I defer my admission to a future term?\nIf I am not admitted, may I re-apply the following year?\nCalendar/Timeline\nWhen is the deadline to submit application material?\nWhen will my application be reviewed?\nWhen will I be informed of my admission status?\nWhen is the university closed for the holidays?\nDegree Objective and Requirements\nMay I apply to both M.S. and Ph.D. degree programs?\n\nMay I apply to the M.S. program if I already have earned or will soon earn a master’s degree?\nAm I required to have a master’s degree to apply to the Ph.D. program?\nIf I am a Ph.D. applicant, may I earn an M.S. degree while completing my Ph.D. at UCLA?\nDoes Computer Science offer a distance learning program?\nDoes Computer Science offer a part-time program?\nHow long does it take to earn an M.S. or Ph.D. degree?\nIs there a specialization for the MS program?\nGRE (Graduate Record Examination)\nFor Fall 2025-2026 admissions application cycle only:\nStudents who wish to apply for admission to our graduate program for the 2025-2026  academic year (applications are due December 15, 2024) are not required to take the GRE or submit a GRE score report as part of their application package. However, students may voluntarily submit GRE test scores and they will be reviewed as part of the holistic application consideration. The applications with GRE scores will not be given greater weight than those that do not include scores.\nWhat is UCLA’s GRE institution code? What is the GRE department code?\nI have completed a master’s degree. Do I need to take the GRE?\nIs the GRE computer science subject test required?\nDoes either the university or the department require a minimum GRE score?\nI will not receive official GRE scores until after the application deadline.\nWhen do GRE results expire?\nFor multiple GREs, which scores do you use?\nWill you receive my GRE report if I did not provide the department code or provided an incorrect department code?\nMay I request that ETS send my score report to UCLA before I submit the online application?\nTOEFL/IELTS (International Applicants Only)\nWhat is UCLA’s TOEFL institution code? What is the TOEFL department code?\nCan my TOEFL/IELTS requirement be waived? I attended an institution at which all instruction was done in English.\nWill my application still be considered for admission if I scored below the minimum on one of the sections of the TOEFL?\n\nFor multiple TOEFLs, which scores do you use?\nI will not receive official TOEFL/IELTS scores until after the application deadline. Will I still be considered for admission?\nWhen do TOEFL/IELTS results expire?\nWill you receive my TOEFL report if I did not provide the department code or provided an incorrect department code?\nMay I request that ETS send my score report to UCLA before I submit the online application?\nWhere may I find additional information concerning English requirements?\nTranscripts (Not required from UCLA students and alumni)\nHow many transcripts are required and where do I send them?\n\n\n\nI have requested that transcripts be sent to you, but I am concerned that you will not receive them by the deadline of December 1. If they arrive late, will I still be considered for admission?\nFor International Applicants Only\nHow do you evaluate transcripts issued in a language other than English?\nMy university does not assign grades on a 4.0 grade scale. Should I calculate my GPA?\nMy official transcripts do not contain all the requested information such as the month and year of award. Do I need to submit a diploma?\nLetters of Recommendation\nMay I submit more than 3 letters of recommendation?\nCan I change my recommenders or send them reminders?\nCan recommendations be sent directly to the department?\n\nMay I ask my work supervisors to submit letters of recommendation? I graduated several years ago and am having difficulty contacting my former professors.\nWill my application be considered if my recommenders submit letters after December 15?\nMBA/MSCS Concurrent Degree Program\nHow do I apply to the MBA/MSCS Concurrent Degree Program?\nWhat are advantages of completing the concurrent degree program?\nWhere can I obtain additional information about the program?\nMajor (Field of Study)\nAm I required to choose a major or a field of study within computer science on the Graduate Division online application?\nMay applicants apply to more than one academic program (e.g. CS and EE)?\nPersonal Statement\nIn addition to the statement of purpose, is a personal history statement or writing sample required?\nStatement of Purpose\nAre there format or length requirements?\nIn addition to the statement of purpose, is a writing sample required?\nWriting Sample\nIs a writing sample required?\nCost of Attendance\nWhat is the cost of attendance at UCLA?\nWhen is the deadline to submit the CFS?\nFunding\nDo I need to submit an application for departmental funding?\nHow do I apply for a teaching assistantship (TA) position?\nHow do I apply for a graduate student researcher (GSR) position?\nVisa (International Applicants Only)\nHow much funding must I provide to qualify for a visa to study in the United States?\nWhen may I apply for a visa?\nConfidential Finance Statement (CFS): International M.S. Applicants Only\nWhen is the deadline to submit the CFS?\nHow much funding must I provide to qualify for a visa to study in the United States?\nHousing\nIs there university housing and, if so, when can I apply?\nAre there any special housing arrangements for computer science students?\nHow do students locate housing around UCLA and Los Angeles?\n\n© Copyright 2025 UCLA Samueli School Of Engineering\nContact Us\nAccessibility\nTerms of Use\nSafety First\nUCLA\nWe use cookies to understand how you use our site and to improve your experience, including personalizing content and to store your content preferences. If you would prefer, you may set your browser to refuse cookies or alert you when cookies are being sent. However, it is possible that some parts of our sites will not function properly if you do so. By continuing to use our sites, you accept our use of cookies and Terms of Use.\nI ACCEPT",
        "tags": [
            "cs",
            "2025",
            "ms",
            "ucla"
        ]
    },
    {
        "id": "university_of_washington",
        "title": "University of Washington - MSCS Deadlines",
        "text": "Skip To Content\nQUICK LINKS\nSchool of Science, Technology, Engineering & Mathematics\n\n\n\n\n\n\n\n\nABOUT\nUNDERGRADUATE\nGRADUATE\nFACULTY\nSTAFF\nINDUSTRY PARTNERS\nEVENTS\nNEWS\nRESEARCH & LABS\nGIVE\nSkip Sidebar\nGraduate\nAdmissions\nMaster of Science in Cybersecurity Engineering\nMaster of Science in Computer Science & Software Engineering\nAdmissions\nHow to Apply\nTuition\nCurriculum\nAdvising\nCareers\nMaster of Science in Electrical & Computer Engineering\nGraduate Certificate in Software Design & Development\nGraduate Certificate in Electrical & Computer Engineering Foundations\nCareer Resources\nThesis/Project Final Defense Schedule\nCONTACT US\nSchool of Science, Technology, Engineering & Mathematics\nstemgrad@uw.edu\n425.352.5490\nSchool of Science, Technology, Engineering & Mathematics | Graduate Programs | Master of Science in Computer Science & Software Engineering | Admissions\nAdmissions\nAdmission to the Master of Science in Computer Science & Software Engineering\nAdmission into the Master of Science in Computer Science and Software Engineering is offered for the autumn quarter. Complete applications are reviewed and sent to the admission committee on a rolling basis, beginning early February, and decisions are typically sent 8 weeks after the review process begins. Applicants are encouraged to ensure all application materials are complete and accurate at the time of submission.\nAutumn 2025 application deadlines\nInternational: March 3, 2025 – no longer accepting applications\nDomestic: May 1, 2025\nAdmission requirements\nAdmission to the Master of Science in Computer Science & Software Engineering program requires applicants to have:\nBachelor’s degree in computer science or other closely related field from a regionally accredited institution (or an equivalent international degree)*\nIncluding software engineering, data structures and algorithms, and a high-level object-oriented programming foundations and skills\nEnglish language proficiency\n3.0 GPA or equivalent in the last two years of study\n*Alternatively, applicants may meet this requirement with a bachelor’s degree in another field AND completion of the Graduate Certificate in Software Design & Development.\nApplication process & checklist\nApplicants will apply online through the UW Graduate School. There are various components that go into preparing and submitting a complete application. Given our holistic admission process, a competitive application is one that demonstrates academic performance through a variety of methods and personal qualities and achievements.\nOnline UW Graduate School application & application fee\nUnofficial transcripts\nApplication questions (multiple short answer responses)\nCurrent resume\n2-3 letters of recommendation\nResearch essay\nOfficial English language proficiency test scores (Non-Native English speaking applicants)\nAdditional documents (optional)\nOfficial GRE scores (optional)\nAPPLY NOW\nConnect with us\nRegister for a CSS Graduate Programs Information Session\nEmail us or call 425.352.5490 if you have any questions\n\n\nBothell, Washington\n425.352.5000\nVISITORS\nMAPS & DIRECTIONS\nJOBS\nCONTACT\nPRIVACY\nTERMS\nSEATTLE CAMPUS\nTACOMA CAMPUS\n© 2025 University of Washington Bothell",
        "tags": [
            "cs",
            "2025",
            "ms",
            "university_of_washington"
        ]
    },
    {
        "id": "university_of_illinois_urbana-champaign",
        "title": "University of Illinois Urbana-Champaign - MSCS Deadlines",
        "text": "UNIVERSITY OF ILLINOIS URBANA-CHAMPAIGN\nAlumni\nCorporate\nPeople\nMy.SiebelSchool\nThe Grainger College of Engineering\nSiebel School of Computing and Data Science\nSearch\nAbout\nAdmissions\nAcademics\nResearch\nNews\nStudent Life\nBroadening Participation\nGive\nHome\nAdmissions\nGraduate Admissions\nApplications Process & Requirements\nApplications Process & Requirements\nAdmissions\nAdmitted Students\nUndergraduate Admissions\nGraduate Admissions\nApply Now\nDegree & Program Options\nApplication Deadlines\nApplications Process & Requirements\nAdditional Required Application Materials for International Students\nApplication Fee Waivers\nApplication Checklist\nFAQs\nCheck Application Status\nImpact of an Illinois Computing and Data Science Degree\nFinancial Aid\nCurrent Siebel School for Computing and Data Science graduate students must follow the same application process as all other applicants. Current Siebel School for Computing and Data Science undergraduate students applying to the Fifth Year Masters Programs, please review each program's application process.\nPhD applicants:  PhD applicants whose native language is not English (regardless of citizenship status) must review the information on \"Financial Aid Considerations for On-campus Applicants\" provided on the Additional Required Application Material page. PhD applicants maybe required to submit TOEFL iBT or IELTS speak scores even if they meet the English proficiency requirements for admissions.\n1. Review these general University and School requirements:\nApplicants must have been awarded (or are about to be awarded) a 4-year bachelor’s degree equivalent to that granted by the University of Illinois to be eligible for the graduate programs at the University of Illinois Urbana-Champaign. Applicants whose undergraduate degree is a three-year program may not be eligible for graduate-level admissions consideration at the University of Illinois. Eligibility depends on the country where the applicant received their degree -- please see the Graduate College's list of eligible degrees.\nThe University of Illinois Urbana-Champaign policy requires applicants to hold at least a 3.0/4.0 or higher GPA in the last two years of their undergraduate study to be eligible for graduate studies on this campus.\nApplicants who already hold a master’s degree in computer science or computer engineering whose degree requirements are equivalent to a Siebel School for Computing and Data Science master’s degree are not eligible to apply for our MS or Professional Master of Computer Science (MCS) degree.\nApplicants who do not hold a bachelor’s degree in computer science must have sufficient background in computer programming, data structures and algorithms, computer architecture, and theory of computation. We highly recommend applicants complete courses in these areas at a local university near them prior to submitting their application.\n2. Plan to meet the application deadline\nVisit our Application Deadlines page to review the deadlines for all of our Graduate Programs. All application materials, including the application fee, must be received by the posted deadline. (Posted deadlines are for U.S. Central Time Zone). Late applications will not be accepted. In addition, incomplete applications will be subject to denial.\nIt is highly recommended to have all application materials submitted one month prior to the deadline to expedite admission decisions.\n3. Complete the university's online application\nApply online.  If you are applying to the MCS in Chicago Program, please note that the program name in the application drop-down menu is: “Computer Science (Site-Based Off Campus)-MCS”.\n\nNote: Please do not send additional materials (e.g. publications, photographs, videos, CDs, or portfolios). These items are not reviewed during the admissions process.\n4. Pay the application fee\nThe university's application fee is $70 for US citizens and permanent residents and $90 for all other applicants. The fee must accompany the application by credit card payment with the web application. Application fees are non-refundable.\nApplication Fee Waivers: Applicants may qualify for an application fee waiver.  For details, see Application Fee Waivers.  Applicants with questions about an application fee waiver may contact the Siebel School for Computing and Data Science at grad-admissions@siebelschool.illinois.edu.\n5. Submit Unofficial Transcripts\nSiebel School for Computing and Data Science does not require submission of official transcripts during the initial application review process. Applicants must submit official credentials (transcripts, academic records, diplomas, certificates of degrees, etc.) only if they are recommended for admission to the Graduate College at the University of Illinois at Urbana-Champaign. Applicants recommended for admission will be required to submit their official transcripts directly to the Graduate College.\nTo complete your application, please follow the instructions provided by the Graduate College:\n“Applicants must list in the online application each institution of post-secondary education from which they have earned credit. Applicants must also upload scanned copies of their transcript / academic record (and diplomas or certificates of degrees if the degree is awarded and not listed on the transcript) for each of these institutions to their online application.”\nNotes:\nScanned transcripts must include all grade records and the grading scale used by the institution. (If the grading scale is on the back of the transcript, a separate scanned page should be included.) If the original transcripts are not in English, native-language transcripts and an English translation must be uploaded. The applicant is responsible for ensuring that uploaded copies are legible and high-resolution.\nDo not upload password-protected transcripts. If you receive password-protected transcripts from your educational institutions, please print them and scan them to a PDF file before uploading.  Our Admissions Committee cannot view password-protected transcripts.\nSubmission of Official Academic Credentials (Graduate College policy)\n“All credentials uploaded to the online application are considered unofficial. You will only be asked to submit official credentials (transcripts, academic records, diplomas, certificates of degrees, etc.) if you are admitted. These must be submitted during your first term of enrollment at the University of Illinois.\nThe University of Illinois reserves the right to require official academic credentials at any time during the admissions process, and to rescind any offer of admission made if discrepancies between unofficial and official transcript(s) are found.”\n6. Request Letters of Recommendation\nApplicants to the PhD and MS with thesis programs are required to have three letters of recommendation submitted. Applicants to the MCS program are not required to have letters of recommendation, but letters will be considered if included, especially if used to justify experience in lieu of required coursework, or other irregularities.\nIt is recommended that professional letters of recommendation be from academics. They can either be your faculty, advisors, or supervisors. If you have been away from academics for a significant amount of time, you may substitute non-academic references of your choice (e.g. immediate supervisors, etc.). Personal letters of references (e.g. from family members) are not recommended.\nThe letters should address your academic abilities and potential to succeed at graduate-level academic performance.  If you apply to our M.S. or Ph.D. program, your letters should also address your research abilities and potential.\nIndividuals writing letters of recommendation on your behalf should submit their letters through the online application system. Any recommendations that do not follow this process may impact timely application processing.\nPlease make sure recommenders complete the section on the “Recommender’s Form” that states “To what extent do you recommend this applicant for admissions as a graduate student in their proposed field of study”.\n7. Write an Academic Statement of Purpose (required)\nThe Academic Statement of Purpose is a required part of the online application form.\nThis statement should include your goals and background as it relates to the field of computer science. It is good to include any past work history, your interests, and reasons for pursuing a graduate degree in computer science.\nYour statement will be evaluated for your conciseness, reasons for pursuing a graduate degree, leadership skills, and eloquence.  Applicants to our M.S. or Ph.D. program will also be evaluated according to their scientific research interests.\nGenerally, the Academic Statement of Purpose is between one to two pages.\n8. Write Personal Statements (required)\nThe Personal Statement is required for Computer Science admissions purposes.\nThe Personal Statements must be within 250 words.\n9. Create a CV/Resume\nYour CV/resume is a part of the online application form.\nYour CV/resume should address your education, job experience, research experience (M.S. or Ph.D. applicants), remarkable achievements, publications, organizations, awards, and leadership experiences.\nThis information helps the admissions committee understand your background. In addition, it helps when identifying M.S. or Ph.D. applicants for RA and TA assistantships.\n10. General Record Examination (GRE) – Not Required\nThe Graduate Record Examination (GRE) general aptitude tests (Verbal, Quantitative, and Analytical) and subject test scores are recommended but not required. In some cases, the scores may provide helpful supporting information. If you would like to submit scores, we recommend that you scan your official score report as a PDF file and attach it to your application. You do NOT need to submit official scores through ETS.\n11. English Proficiency and International Requirements\nEnglish proficiency requirements.  This applies to all applicants whose native language is not English, including permanent residents of the US.\nThe minimum requirements for admission are as follows: Proficiency Requirements for Admission.\nTo be eligible for school financial aid, such as a teaching assistantship, you must submit recent TOEFL iBT or IELTS scores and/or meet the requirements detailed here: Proficiency Requirements for Funding (summary).\nAll international applicants should make every effort to meet English proficiency requirements for funding.  Applicants who meet the proficiency requirements are given preference for admission. Applicants with TOEFL iBT speak scores below 22 have a low chance of admission.\nIf admission is offered, international applicants to the on-campus programs must submit the Declaration & Certification of Finances Form. This form does not need to be submitted with the application materials.\n12. Check the status of your application materials to ensure all materials have been submitted.\nPlease check your application in the Graduate College application portal to ensure all required materials have been submitted.\nIf your email address changes between the time you submit your application and the decision deadline, email your updated email address to grad-admissions@siebelschool.illinois.edu. Include your old email address, new email address, first and last name, and application reference number in the email message.\n13. Wait for admissions results\nAdmissions results will be sent to your email address by the posted decision deadline.\nApplicants can appeal the admission decision by uploading the Appeal Form to their Graduate College application. Immediately after the appeal form is uploaded, please notify the school by following the instructions provided on the form. (Please do not send the appeal form or any supporting material directly to the school.) Fall term admission appeals for the PhD, CS MS, and on-campus MCS programs must be submitted by April 15th and will be reviewed no later than May 15 by the CS Admissions Committee. Admissions appeals for the online MCS, Chicago MCS, MS Bioinformatics, BS-MS, and BS-MCS programs must be submitted within 14 days of the date when admissions decisions were released. Appeals and emails notifying of submission received after the posted deadlines will not be considered. \nPursue infinite possibilities with Grainger Engineering\nApply to Undergrad Programs\nApply to Graduate Programs\nSiebel School of Computing and Data Science\nTwitter\nInstagram\nFacebook\nLinkedIn\nYouTube\nThomas M. Siebel Center for Computer Science\n201 N. Goodwin Avenue, MC-258\nUrbana, IL 61801\nThe Grainger College of Engineering\nContact Us\nph: 217-333-3426 (general)\nph: 217-333-4428 (advising)\nGraduate Admissions: grad-admissions@siebelschool.illinois.edu\nGraduate Advising: grad@siebelschool.illinois.edu\nUndergraduate Advising: undergrad@siebelschool.illinois.edu\nGeneral Email (not for admissions inquiries): admin@siebelschool.illinois.edu\nCommunications: communications@siebelschool.illinois.edu\nWebmaster: grainger-marcom@illinois.edu\nChicago Office\n200 South Wacker Drive, 7th Floor\nChicago, IL 60606\n.st0 { fill: #FFFFFF; } .st1 { fill: #FF5F05; }\nAround Campus\nCampus Map\nUniversity Admissions\nCareers at Illinois\nUniversity News\nGiving at Illinois\nUniversity Alumni\nAthletics\nUniversity Library\nUniversitywide Resources\nEmergency Services\nUniversity Calendars\nUniversity Directory\nStudent Assistance Center\nHealth and Wellness\nParents and Families\nUniversity COVID-19 Information\nAbout Illinois\nVC of Diversity, Equity and Inclusion\nLand Acknowledgement\nUniversity Research and Innovation\nTechnology Services\nIllinois International\nUniversity Strategic Plan\nUniversity of Illinois System\nAbout Cookies\nPrivacy Policy\nCopyright © 2025\nAccessibility\nWebmaster\nLogin\nCookie Notice\nWe use Cookies on this site to enhance your experience and improve our marketing efforts. Click on “About Cookies” to learn more. By continuing to browse without changing your browser settings to block or delete Cookies, you agree to the storing of Cookies and related technologies on your device.University of Illinois System Cookie Policy\nAbout Cookies Close this Notice",
        "tags": [
            "cs",
            "2025",
            "ms",
            "university_of_illinois_urbana-champaign"
        ]
    },
    {
        "id": "georgia_institute_of_technology",
        "title": "Georgia Institute of Technology - MSCS Deadlines",
        "text": "Skip to main navigation\nSkip to main content\nCollege of Computing\nMain navigation\nAbout\nFuture Students\nCurrent Students\nSchools\nNews & Events\nPeople\nResearch\nIndustry\nAction Menu\nICLR 2025\nContact Us\nCHI 2025\nMS Computer Science Admission Requirements\nAdmission to the program is highly selective; there are many more qualified applicants than there are places in the program. The challenge for the College every year is to select a class from a highly qualified pool. The College looks for compelling reasons to admit candidates, and the statement of purpose, letters of recommendation, test scores and GPA are all reviewed carefully. Having a strong undergraduate background in computer science, including C programming, is highly recommended for applicants. The Admissions Committee welcomes additional pertinent information that will aid in making objective and informed decisions.\nStudents are admitted to the master's program only once a year. The application deadline is Feb. 1 for admission to the following fall semester.\nApplication Requirements\nCompletion of the online application.\nReceipt of three recommendation letters (requested within the on-line application).\nScores from the general Graduate Record Examination (GRE) are required. Applicant scores are expected to be at least 153 in the Verbal, 155 in the Quantitative, and 3.0 in the Analytical sections for the MS program.  This requirement cannot be waived.\nThe desirable minimum GPA is 3.0/4.0, though most candidates score higher.\nSee the Institute's English Proficiency Requirements.  Our department requires a 100 minimum score on the TOEFL. We will also accept IELTS to fulfill english proficiency.  A minimum overall score of 7.5 is required, with minimum section scores as follows:  Reading 6.5, Listening 6.5, Speaking 6.5, Writing 5.5.\nA student who is enrolled in another graduate program of the Institute may pursue an MSCS while that student is also pursuing his or her degree in the other major. To be granted permission to pursue the MSCS, a student must submit to the Office of Graduate Programs in the College of Computing the material required for admission to the MSCS program. This includes transcripts, letters of recommendation, and the GRE General Test. If the student is approved by the admissions committee to pursue the MSCS, the student will be notified in writing. At no time will a student outside the College be allowed to pursue a concurrent degree without prior permission of the admissions committee.\nAdmissions FAQ\nGeorgia Tech Coronavirus Resources\nAcademic Continuity Resources\nGuidance for Graduate Education\nHosting a Virtual Event\nMonitoring Coronavirus On Campus\nOneUSG Connect Training Online\nPartial Day Absence (How to Submit)\nWhich GT services require VPN?\nDean's Messages\nTuesday, August 3, 2021\nThursday, July 29, 2021\nTuesday, July 27, 2021\nTuesday, July 20, 2021\nTuesday, July 13, 2021\nArchive\nGT Computing Helping Stories\nComputing Framework Could Reveal Signs of Neuro Disorders Hidden within Brain Data\nFaculty Earn Fellowships for Heart Modeling and Data Optimization Research\nMeet CSE Profile: Grace Driskill\nComputing Student Runs into History Books for Athletic and Academic Achievement\nMachine Learning Encoder Improves Weather Forecasting and Tsunami Prediction\nGEORGIA TECH RESOURCES\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVISITOR RESOURCES\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nCOLLEGES, INSTRUCTIONAL SITES AND RESEARCH\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nCOLLEGE OF COMPUTING RESOURCES\nIntranet\nSTUDENT AND PARENT RESOURCES\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nNEWS FEED\nComputing Framework Could Reveal Signs of Neuro Disorders Hidden within Brain Data\nA Georgia Tech doctoral student’s dissertation could help physicians…\nStudent Innovation Shines at Spring 2025 CS Junior Design Capstone Expo\nFrom a digital tool to enhance workshops to a real-time analytics…\nProfessor's CNBC Course Highlights College’s Leadership in Expanding AI Literacy\nIf you’re worried about artificial intelligence (AI) taking your job,…\nGeorgia Institute of Technology\nNorth Avenue\nAtlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2025 Georgia Institute of Technology\nGT LOGIN",
        "tags": [
            "cs",
            "2025",
            "ms",
            "georgia_institute_of_technology"
        ]
    },
    {
        "id": "yale_university",
        "title": "Yale University - MSCS Deadlines",
        "text": "Skip to main site navigation\nSkip to main content\nYale Graduate School of Arts and Sciences homepage\nAudience\nYale University\nProspective Students\nIncoming Students\nCurrent Students\nFaculty & Staff\nAlumni\nClick to open\nPrograms of Study\nClick to open\nAdmissions\nClick to open\nFinancial Support\nClick to open\nAcademic Resources\nClick to open\nStudent Support\nClick to open\nAbout\nClick to open\nComputer Science\nFields of study include algorithms and computational complexity, artificial intelligence, data networking, databases, graphics, machine learning, programming languages, robotics, scientific computing, security and privacy, and systems.\nPrograms of Study Computer Science\nTerminal Degrees Offered\nPhD - Doctor of Philosophy\nMS - Master of Science\nProgram Website\nComputer Science\nPrograms and Policies\nComputer Science\nLin Zhong\nDirector of Graduate Studies\nlin.zhong@yale.edu\nRagini Jain\nDepartmental Registrar\nragini.jain@yale.edu\n203-432-5768\nApplication Deadline\nPhD - December 15\nMS - January 2\n11:59pm ET\nApplication Instructions\nOn this Page\nAdmission Requirements\nAcademic Information\nFinancial Information\nProgram Statistics\nAdmission Requirements\nStandardized Testing Requirements\nPhD - GRE is not accepted.\nMS - GRE is required.\nEnglish Language Requirement\nTOEFL iBT or IELTS Academic is required of most applicants whose native language is not English.\nYou may be exempt from this requirement if you have received (or will receive) an undergraduate degree from a college or university where English is the primary language of instruction, and if you have studied in residence at that institution for at least three years.\nAcademic Information\nAdvising\nProgram Advising Guidelines\nGSAS Advising Guidelines\nAcademic Resources\nAcademic Calendar\nThe Graduate School's academic calendar lists important dates and deadlines related to coursework, registration, financial processes, and milestone events such as graduation.\nFeatured Resource\nRegistration Information and Dates\nhttps://registration.yale.edu/\nStudents must register every term in which they are enrolled in the Graduate School. Registration for a given term takes place the semester prior, and so it's important to stay on top of your academic plan. The University Registrar's Office oversees the systems that students use to register. Instructions about how to use those systems and the dates during which registration occurs can be found on their registration website.\nFinancial Information\nRESOURCE CATEGORY\nPhD Stipend & Funding\nPhD students at Yale are normally fully-funded. During their programs, our students receive a twelve-month stipend to cover living expenses and a fellowship that covers the full cost of tuition and student healthcare.\nPhD Student Funding Overview\nGraduate Financial Aid Office\nPhD Stipends\nHealth Award\nTuition and Fees\nRESOURCE CATEGORY\nMaster's Funding\nWhile Master's programs are not generally funded, there are resources available to students to help navigate financial responsibilities during graduate school.\nMaster's Student Funding Overview\nGraduate Financial Aid Office\nTuition and Fees\nYale Student Grants Database\nStudent Employment\nLoans for US Citizens\nLoans for Non-US Citizens\nAlumni Insights\nExplore More\nBelow you will find alumni placement data for our departments and programs.\nHow can we help support you?\nCURRENT STUDENTS\nThe Graduate School offers a wide variety of resources to help you navigate your intellectual and professional growth while at Yale. Use the buttons below to explore more.\nFinancial Support\nAcademic Resources\nStudent Support\nApply to GSAS\nPROSPECTIVE STUDENTS\nDo you have intellectual curiosity, a passion for discovery, and potential for leadership?\nApply Now\nWarner House \n1 Hillhouse Avenue\nNew Haven, CT 06511\nPrograms of Study\nAdmissions\nFinancial Support\nAcademic Resources\nStudent Support\nAbout\nCommencement\nLocal 33 Union\nContact\nWhat are you for?\nExplore the Graduate School of Arts and Sciences within Yale’s For Humanity campaign.\nMake a Gift\nCopyright © 2025 Yale University. All Rights Reserved.\nAccessibility at Yale\nPrivacy Policy\nYale edu\nPrivacy policy statement. Our privacy policy has recently been updated.\nPrivacy Policy\nDismiss",
        "tags": [
            "cs",
            "2025",
            "ms",
            "yale_university"
        ]
    },
    {
        "id": "johns_hopkins_university",
        "title": "Johns Hopkins University - MSCS Deadlines",
        "text": "Secondary Navigation\nCS IT Support\nDepartment of Computer Science\nDepartment of Computer Science\nUtility Navigation\nREQUEST INFO\nAPPLY\nGIVE\nAbout\nAcademic Programs\nResearch\nPeople\nNews\nEvents\nAlumni & Giving\nSearch\nInfo For\nHOME\nACADEMIC PROGRAMS\nGRADUATE STUDIES\nGraduate Studies\nOur goal is to create a collaborative and empowering environment for over 350 graduate students.\nIN THIS SECTION\nGRADUATE STUDIES NAVIGATION\nPause background animation\nWorking side-by-side with faculty who are redefining their fields of inquiry, graduate students in the Department of Computer Science apply their skills to topics ranging from mitigating the effects of nefarious computer hackers to building smart AI into novel systems to improving our ability to diagnose and treat disease.\nOver the past two years alone, the links between our field and the most influential world events have been a constant. There are direct connections to the COVID-19 response, such as the role of computational biology in characterizing variants and the use of geographical data systems in tracking infections, mortality, and vaccinations. The worldwide struggle for racial and social justice also needs to be supported by machine learning and artificial intelligence algorithms that are anti-racist. Fair elections and trustworthy news rely on information technology tools that combat disinformation.\nWe invite you to learn more about our graduate programs and consider the many ways we can help you make an impact on the world.\nGraduate Programs in Computer Science\nMaster of Science in Engineering in Computer Science\nStudents in our MSE program gain firsthand knowledge of current research and its applications and can develop an academic program that meets their academic and professional interests and goals.\nMSE IN COMPUTER SCIENCE\nMaster of Science in Security Informatics (MSSI)\nThe full-time MSSI program is an immersive, three-semester program providing educational, research, and professional opportunities that are simply unparalleled in this rapidly expanding field.\nMS IN SECURITY INFORMATICS\nPhD in Computer Science\nStudents who complete our PhD program are well-prepared for careers in academia, research, government, and industry.\nPHD IN COMPUTER SCIENCE\n“\nThe department’s combination of theoretical foundation and hands-on experience prepared me to understand and tackle research challenges. The faculty also actively promote industry collaborations and helped connect me with world-leading researchers within JHU and beyond. ”\nZhaoshuo “Max” Li\n‘19 (MSE), ‘22 (PhD)\nHome to Hopkins\nFull-time students are eligible to take up to two online courses through the Engineering for Professionals program the summer before they start their full-time, residential master’s program. These courses apply to their master’s degree if satisfactorily completed. It’s a new, transformative way to earn your master’s degree!\nREQUEST INFO\nJoin us\nLearn about the graduate admissions process of Johns Hopkins engineering and start your application today.\nLEARN ABOUT GRADUATE ADMISSIONS\nSTART YOUR APPLICATION TODAY\nFor Current Students\nPolicies, resources, forms, course information, and services for graduate students.\nRESOURCES FOR GRADUATE STUDENTS\nStay Connected\nFACEBOOK\nX\nINSTAGRAM\nYOUTUBE\nLINKEDIN\nOpen site alert\nDepartment of Computer Science\nADDRESS\n3400 North Charles Street\nBaltimore, MD 21218\nGET DIRECTIONS\nCONTACT\nEMAIL:\nCONTACTUS@CS.JHU.EDU\nFooter Navigation\nAPPLY NOW!\nWHITING SCHOOL OF ENGINEERING\nJOHNS HOPKINS UNIVERSITY\nLegal Navigation\nPrivacy Statement\nAccessibility\nUniversity Policies\nCopyright Compliance Policy\n2025 Johns Hopkins University. All rights reserved.",
        "tags": [
            "cs",
            "2025",
            "ms",
            "johns_hopkins_university"
        ]
    },
    {
        "id": "columbia_university",
        "title": "Columbia University - MSCS Deadlines",
        "text": "Columbia University in the City of New York\n搜索\nAbout\nResearch\nFaculty\nAcademics\nAdmissions\nAdvising & Student Services\nTheory\nGraphics &\nUser Interfaces\nNLP &\nSpeech\nSecurity &\nPrivacy\nComputational\nBiology\nSoftware\nSystems\nComputer\nEngineering\nNetworking\nVision &\nRobotics\nMachine\nLearning\nArtificial\nIntelligence\nAdmissions Information\nThank you for your interest in our CS@CU programs! Please be sure to read through our pages, and complete keyword searches to help you gather information and make the most informed decision possible regarding the next step in your educational career.\nCONTENTS\nApplication Deadlines Dual MS in Journalism and Computer Science\nUndergraduate Programs PhD Program\nMS Programs CS@CU MS Bridge Program in Computer Science\nMS Express – CU Seniors only FAQs\nUNDERGRADUATE PROGRAMS\nUndergraduates wanting to major in computer science first apply through one of four undergraduate schools:\nColumbia College\nBarnard College\nSchool of Engineering and Applied Science (SEAS)\nSchool of General Studies\n  Still have questions/ ready to apply? Click here!  \nAPPLICATION DEADLINES\nApplications received and considered complete by the priority deadlines will be reviewed first. We recommend you submit your application a couple of weeks before the priority deadline to ensure that all materials, including recommendation letters, are received in time for priority review.\n CS Programs  Fall   Spring\n Doctoral: MS/PhD*, PhD  December 15 October 15\n Master of Science (CS MS)  Priority: January 15   October 15\n Final Deadline: February 15\n MS Express Application\n (Columbia Undergrads only) Priority: February 15  October 15\n Final Deadline: May 1st\n Dual MS, CS & Journalism  January 15  N/A\n CS@CU MS Bridge Program  Priority: February 15th\n Final Deadline: March 1st\n N/A\n* This is NOT a CS MS; it is a degree earned en route to the PhD. CS MS applicants need to follow the Master of Science Deadlines.\nMS PROGRAMS\nThe Master of Science (MS) program is intended for those who wish to broaden and deepen their understanding of computer science. Columbia University and the New York City environment provide excellent career opportunities in multiple industries. The program provides a unique opportunity to develop leading-edge in-depth knowledge of specific computer science disciplines.\nMS applicants whose primary interests include software engineering, theory, AI, machine learning, vision/graphics, natural language processing, or other core CS areas should apply to the Computer Science MS Program.\nMS applicants whose primary interests include computer architecture, parallel systems, embedded systems, or digital/VLSI design should apply to the Computer Engineering MS Program.\n MS Application Priority Deadlines \nApplications will be accepted after priority deadlines; however, we encourage you to submit your application as early as possible after we open the application. \nFall: January 15th (Priority), February 15th (Regular)\nSpring: October 15\n   Track Options \nComputational Biology\nNatural Language Processing\nComputer Security\nSoftware Systems\nFoundations of Computer Science\nVision and Graphics\nMachine Learning\nPersonalized\nNetwork Systems\nMS Thesis\n  Still have questions? View our CS MS Application FAQs  \nDUAL MS IN JOURNALISM AND COMPUTER SCIENCE\nAdmitted students will enroll for a total of five semesters — approximately three in The Fu Foundation School of Engineering and Applied Science and two in the Journalism School. In addition to taking classes already offered at the Journalism and Engineering schools, students will attend a seminar and workshop designed specifically for the dual degree program. The seminar will teach students about the impact of digital techniques on journalism; the emerging role of citizens in the news process; the influence of social media; and the changing business models that will support news gathering. In the workshop, students will use a hands-on approach to delve deeply into information design, focusing on how to build a site, section, or application from concept to development, ensuring the editorial goals are kept uppermost in mind.\n  Want to learn more? Visit the program website!  \nPHD PROGRAM\nA small number of highly qualified students are admitted each year to the PhD Program in Computer Science. Admission is very competitive, based primarily on research-oriented reference letters, academic grades, and overall experience and record. Applicants need not already hold a master’s degree; bachelor’s degree-level applicants are also encouraged to apply.\nMost admitted students receive full financial support through Graduate Research Assistantships, which consist of a monthly stipend plus full tuition exemption (continuation of support is, of course, contingent upon the student’s satisfactory progress in the PhD Program and availability of funding). In addition, the Fu Foundation School of Engineering and Applied Science awards a small number of prestigious “Presidential Distinguished Fellowships.” These fellowships provide full financial support to their recipients. Applicants are strongly encouraged to seek external funding, such as government and industry fellowships. Also, Columbia rents low-cost subsidized apartments near campus for both single students and students with families.\nAll PhD students are expected to participate in departmental and laboratory activity full-time on-campus throughout the program, except possibly for summer internships elsewhere. Therefore, the department does not normally consider admission of part-time students.\nAlso, note that it is not possible to participate in the PhD Program through the Columbia Video Network.\n HOW AND WHEN TO APPLY TO THE PHD PROGRAM \nAll applications to our PhD Program must be made electronically. The online application system is available on the SEAS Admissions website. The deadlines for the submission of your fully completed application are:\nStarting the PhD Program in the Spring semester: apply by October 15 of the previous year\nStarting the PhD Program in the Fall semester: apply by December 15 of the previous year\nYou can still apply after these deadlines. However, be aware that applications are usually reviewed soon after the deadline, so late applications may not be processed as quickly or have the best chance of getting funding from our department.\n HOW TO GET MORE INFORMATION \nThe SEAS Admissions website contains detailed information about all aspects of the application process.\nYou are also encouraged to investigate the research conducted in the Department of Computer Science prior to application. In particular, think about which faculty members share your research interests and also look at the research group homepages. Feel free to contact potential faculty advisors by email to request information about their recent research and publications and to ask about opportunities in their research groups or labs.\nFinally, become familiar with our PhD degree requirements.\nIf you are interested in learning more about a day in the life of our PhD students, check out the Demystifying the Dissertation: PhD Research Discussions seminar series, which highlights several Computer Science PhD students. In their videos, these students discuss their experiences and research projects.\n COMPUTER SCIENCE PhD PRE-SUBMISSION APPLICATION REVIEW (PAR) PROGRAM \nThe PhD PAR program offers a one-time review of an applicant’s Personal Statement and CV. The review is done by a current computer science PhD student. For more information, please visit PhD Pre-Submission Application Review Program.\nQUESTIONS?\nWe receive an enormous volume of emails with application-related questions, so read the FAQ page carefully before sending us an email. Questions about particular research groups or individual faculty members should be directed to the appropriate faculty members by email.\n Transcripts, GRE/TOEFL/ IELTS, fee waivers   Office of Graduate Student Affairs\n Undergraduate Admissions   Office of Undergraduate Admissions\n CS MS Admissions   MS Admissions\n CS PhD Admissions   PhD Admissions\n CVN MS Program   CVN\n  Updated 10/15/2024\nFind open faculty positions here.\nComputer Science at Columbia University\nThe computer science department advances the role of computing in our lives through research and prepares the next generation of computer scientists with its academic programs.\nFind out more about the department here.\nUpcoming Events\nMAY\n01\nCS Career Advising Walk-In Hours\nThursday 2:00 pm\nCS Lounge\n, CS Careers\nMAY\n19\nColumbia Engineering Class Day - Undergraduate Ceremony\nMonday 1:00 pm\nMorningside Campus\nMAY\n19\nColumbia Engineering Class Day - Graduate Ceremony\nMonday 5:15 pm\nSouth Lawn, Morningside Campus\nMAY\n20\nColumbia Engineering Doctoral Hooding Ceremony\nTuesday 3:00 pm\nMiller Theater\nView All >>\nIn the News\nHow a Problem About Pigeons Powers Complexity Theory\nCryptographers Discover A New Foundation For Quantum Secrecy\n(Henry Yuen)\nLarge Language Models Can Do Jaw-dropping Things. But Nobody Knows Exactly Why.\n(Daniel Hsu)\nThe Pro Gamer Who Has To Rely Upon Sound Alone\n(Brian Smith)\nThe Computer Scientist Who Hunts for Costly Bugs in Crypto Code\n(Ronghui Gu)\nPress Mentions\nQuantum Randomness Could Create a Spoof-Proof Internet\nEvolving Leadership In The Age Of AI: 5 Takeaways For 2035\n10 Little Ways To Tell If A Photo Or Video Is AI (For Now)\n(Junfeng Yang)\nComputer Scientists Establish The Best Way To Traverse A Graph\n(Tim Roughgarden)\nAI Is Having Its Nobel Moment. Do Scientists Need The Tech Industry To Sustain It?\n(Jeannette Wing,Richard Zemel)\nColumbia University in the City of New York\nSchool of Engineering and Applied Science\nSEAS Undergraduate Admissions\nSEAS M.S./Ph.D. Application\nData Science Institute\nCS Advising\nMICE\nCRF\nResources for Faculty and Staff\nCopyright FAQ\nComputer Science Department\n500 West 120 Street, Room 450\nMC0401\nNew York, New York 10027\nMain Office: +1-212-853-8400\nDirections\n\nMap\n\nDirectory\n© Columbia\nWebmaster\nPrivacy Policy",
        "tags": [
            "cs",
            "2025",
            "ms",
            "columbia_university"
        ]
    },
    {
        "id": "new_york_university_(nyu)",
        "title": "New York University (NYU) - MSCS Deadlines",
        "text": "Skip to Main Content\nNYU Tandon Logo\nADMISSIONS +\nACADEMICS +\nRESEARCH & INNOVATION +\nLIFE AT TANDON +\nENGAGE +\nABOUT +\nADMISSIONS GRADUATE APPLY\nGraduate Application Deadlines\nRELATED LINKS\nHow to Apply (on campus programs)\nHow to Apply (online programs)\nON THIS PAGE\nOn-Campus Graduate Programs\nOnline Graduate Programs\nApplicants are advised to submit their applications and materials before the deadline. Applications or documents submitted/postmarked after the stated deadlines will not be considered for admission.\nTo ensure the most efficient application processing, submit your application before sending documents or submitting test scores. Deadlines are subject to change.\nOn-Campus Graduate Programs\nSpring 2025 Deadlines\nNovember 1\nFull-time and part-time MS applications* and materials, including test scores, must be submitted or postmarked by this date.\n*The following programs do not accept applications for Spring: PhD programs, Financial Engineering MS, Integrated Design and Media MS, Mechatronics and Robotics MS, Applied Urban Science and Informatics MS, Computer Science MS, Management of Technology MS (on-campus format) and Mathematical Sciences MS.\n  Fall 2025 Deadlines\nDecember 1\nAll full-time and part-time MS applications for priority consideration and materials, including test scores, must be submitted or postmarked by this date.\nDecember 1\nAll PhD applications and materials, including test scores, must be submitted or postmarked by this date.\nFebruary 15 Extended to March 1\nAll full-time and part-time MS applications and materials, including test scores, must be submitted or postmarked by this date.\nJuly 1\nAll online MS applications and materials, including test scores, must be submitted or postmarked by this date.\nOnline Graduate Programs\nSpring, Summer, Fall Deadlines\nVIEW DEADLINES FOR ONLINE PROGRAMS \nAll online graduate programs (M.S. and A.C.)\nNYU Tandon Made in Brooklyn\nQUICK LINKS\nNYU Libraries\nNYU Brightspace\nNYU Albert\nAccessibility\nBulletin\nTandon Directory\nLogin (Faculty & Staff)\nINFORMATION FOR\nStudents\nFaculty\nStaff\nAlumni\nParents\nMedia\nCareers at Tandon\nCONTACT\nContact Us\n\n646-997-3600\nNYU CAMPUSES\nNew York\nShanghai\nAbu Dhabi\nMAKE A GIFT\nFOLLOW US\n© NYU Tandon 2025",
        "tags": [
            "cs",
            "2025",
            "ms",
            "new_york_university_(nyu)"
        ]
    },
    {
        "id": "university_of_texas_at_austin",
        "title": "University of Texas at Austin - MSCS Deadlines",
        "text": "Skip to main content\nTop Bar\nAbout\nNews\nUTCS Direct\nGive\nMain navigation\nRESEARCH\nPEOPLE\n\n\n\n\nAWARDS\nUNDERGRADUATE\nGRADUATE\nENGAGE\nHome\nGraduate\nMaster's Program\nThe Master of Science in Computer Science (MSCS) program is designed for students who have completed a bachelor's degree in computer science and want to further their studies. Admission to the program is highly selective with a limited number of openings and many strong applicants each year. Only applicants who possess a bachelor's degree in computer science or equivalent are likely to be competitive for admission.\nOn-Campus Research Track Degree Options\nThe department offers two on-campus Master's degree options for students interested in pursuing a research career: the MSCS with thesis and the MSCS no thesis/no report. Both degrees require 30 hours of coursework. The no thesis/no report option is defined by more organized coursework than the thesis option, which requires 2 thesis classes. Students admitted to the Master's program do not need to declare which degree they intend to pursue. Students apply to receive the degree in the semester they complete the requirements for the option they chose.\nOnline Professional Degree Programs\nFor students seeking a professional master's degree, the department offers three master’s degrees in an online format. Taught by UT faculty, many of whom are award-winning leaders in the CS research community, these programs provide a flexible learning environment while fostering personal engagement between professors and students. By the end of any of these programs, students will have gained the skills needed to accelerate their careers in their related field.\nStudents seeking a professional degree are strongly urged to apply to one of our online programs, which have a much higher capacity than on-campus programs.\nOnline Master’s in Computer Science\nThe online Master of Science in Computer Science program is primarily designed for working professionals and those planning a career in industry who have a bachelor’s degree in computer science or a related technical field and want to broaden and deepen their knowledge.\nLearn More\nOnline Master’s in Artificial Intelligence\nThe Master of Science in Artificial Intelligence (MSAI) students will receive advanced training in natural language processing, reinforcement learning, computer vision, deep learning and related topics. The degree will provide a critical framework for understanding the ethical implications of AI technologies and equip students for an array of potential career opportunities – from engineering to research and development, and product management to consulting.\nLearn More\nOnline Master’s in Data Science\nUT Computer Science has partnered with the Department of Statistics and Data Science to offer an online Master of Science in Computer Science program (MSDS). The MSDS program supplies rigorous instruction to expand your expertise in areas such as advanced systems design, machine learning and artificial intelligence. Interested in applying?\nLearn More\nPh.D. Students Pursuing a Master's\nPh.D. students may also pursue the research-track on-campus MSCS degree as long as it does not interfere with their pursuit of the doctorate.\nGraduate\nGraduate\nProspective Students\nMaster's Program\nCoursework Option\nThesis Option\nOnline Programs & Degrees\nPh.D. Program\nCourses\nFinancial Information\nIncoming Students\nCurrent Students\nPortfolio Program in Robotics\nCurricular Practical Training\nForms\nGraduate Student Talks\n2317 Speedway, Stop D9500\nAustin, TX 78712\nPhone: 512.471.7316\n © The University of Texas at Austin 2024\nUndergraduate Office\nGraduate Office\nOffice of External Affairs\nWebmaster\nMission Statement\nContact\nUTCS Direct\nEmergency Information\nSite Policies\nWeb Accessibility Policy\nWeb Privacy Policy",
        "tags": [
            "cs",
            "2025",
            "ms",
            "university_of_texas_at_austin"
        ]
    },
    {
        "id": "uc_san_diego",
        "title": "UC San Diego - MSCS Deadlines",
        "text": "Skip to main content\nCSE Main Menu\nAbout\nResearch\nGraduate\nUndergraduate\nDiversity\nCommunity\nGiving\nGRADUATES\nGraduate Admissions\nApplication Checklist\nGraduate Admissions FAQ\nFinancial Opportunities\nAdvice on CSE Graduate Studies Preparation\nGraduate Programs\nCourses and Enrollment Information\nAdvising\nFinancial Opportunities\nFellowships and Scholarships\nTeaching Assistantships\nGraduate Student Life\nGraduating PhDs\nDeepMind Fellowships\nCSE GRADUATE APPLICATION CHECKLIST\nUpdated September 13th\n  Fall 2025 Application opens on Fall 2025 admission from September 4, 2024 until December 18, 2024 at 11:59 p.m. PST.\nBelow is a list of the required materials that must be submitted as part of the graduate application to the MS or the PhD program.\nCURRENT OR FORMER UCSD STUDENTS who wish to TRANSFER from their current graduate program to a different program (e.g., MS to PhD), should follow instructions below* or contact their student affairs staff advisor for questions on that process.  Current UCSD CSE undergraduate majors who wish to pursue a CSE masters should consider the Bachelors/Masters program.\n1. ONLINE APPLICATION: UCSD APPLICATION FOR GRADUATE ADMISSION\nApplicants should review the Graduate Division's Applying to Graduate Admissions website prior to submitting their application. \n**All application documents are submitted online to the UCSD Application for Graduate Admission at https://connect.grad.ucsd.edu/apply/ (please do not mail documents to the department). \nPhD Applicants Only: The CSE department has a limited number of application fee waivers available for international students. Our department will be granting these waivers to students based on factors that include: contributions to diversity; social justice experience; overcoming adversity. Unfortunately, we are not able to grant application fee waivers on the basis of financial need alone. If you would like to request a CSE department fee waiver, please fill out the Fee Waiver Application listed on our main admission page.\nApplication Status Checks: All applicants will receive a final decision via the online application by April. Applicants may check their online application for updates. Due to the high volume of inquiries, emails requesting application status updates will not receive responses.\n2. TRANSCRIPTS\nUnofficial transcripts should be uploaded online to the UCSD Application for Graduate Admission. This is all that is required for the application process.\nReview the Graduate Division transcript instructions carefully - Academic Records and Transcripts\nPlease do not mail any documents to the department. If offered admission, students will mail the official transcripts to the Graduate Division.\nIf a student is offered admission to the program: Official transcripts of record from each university-level institution attended must be provided. A summary of credit transferred from an institution previously attended and recorded on the transcript issued by the school granting the degree will not suffice. Applicants should request that official transcripts of all previous academic work, including certification of degrees received or documentation of status upon leaving each institution, be mailed to the Graduate Division. Only official records bearing the signature of the registrar and the seal of the issuing institution will be accepted.\nApplicants who attended any campus of the University of California, including UCSD, must provide official transcripts of the UC coursework. Transcripts from UCSD may be ordered by an applicant from the Office of the Registrar. There is no charge for UCSD transcripts of record sent to departments in support of an application for graduate study.\nInternational applicants: \nIf a student is offered admission to the program: True copies, facsimiles, or photostatic copies of foreign academic records will be accepted if, after the copies have been made, they have been personally signed and stamped by an educational official who certifies that they are exact copies of the original document. Properly certified and signed copies should be sent instead of irreplaceable original documents. Academic records must be in the language of the institution and should be accompanied by an official English translation. Foreign academic records must show all courses attended each year, examinations passed, seminars completed, and grades or marks received at all institutions where formal records are maintained.\n3. STATEMENT OF PURPOSE\nThe statement of purpose must be submitted online through the UCSD Application for Graduate Admission.\nAn applicant's statement of purpose is very important and is given careful consideration in the selection process. For additional guidelines, please refer to Statement of Purpose. There is no specific word limit, but be concise and specific in preparing your statement, giving information that demonstrates your level of preparation and potential for success in graduate school. Applicants should address past accomplishments within the realm of computer science and engineering, why they are qualified for the program, and goals they wish to pursue while in graduate school.\nNOTE: Requests to update the Statement of Purpose are not granted after submission. Please carefully double-check edits prior to official submission. \n4. THREE LETTERS OF RECOMMENDATION\nThree (3) letters of recommendation are required. Additional letters may be submitted, however, you must submit a minimum of three (3) letters.\nLORs are submitted via the online application only. For additional information about the procedures and policies for letters of recommendation, please review the UCSD Graduate Division guidelines at Procedures for Letters of Recommendation.\nIt is important that letters of recommendation be completed by individuals who are in a position to analyze your abilities and academic promise. References generally hold an academic position. Letters from research or project advisors are also acceptable, as well as LORs from a professional/industry referee. \n5. GRE SCORE REPORT\nThe GRE is not required for PhD and MS applications for Fall 2025.  Applicants may still submit valid scores if they have already taken the test.\nApplicants with valid test scores should request that ETS submit the scores directly to the UCSD institution code 4836. The department codes are not necessary. Information about the GRE is available from the Educational Testing Service (ETS) website. \n6. ENGLISH LANGUAGE REQUIREMENTS (INTERNATIONAL APPLICANTS ONLY)\nDemonstrated proficiency in the English language is required for all international applicants whose native language is not English. Either the Test of English as a Foreign Language (TOEFL) OR the International English Language Testing System (IELTS) is required for international applicants whose native language is not English and who have not studied full-time at a university-level institution where the sole language of instruction is in English.\nNon-native English language speakers may be exempt from this requirement if they have earned or will be earning a bachelor's, master's, or doctoral degree from either:\nA regionally accredited U.S. college or university where English is the sole language of instruction, or\nA foreign college or university which provides instruction solely in English. You may verify whether your institution meets this requirement by looking up your institution in the IAU World Higher Education Database (WHED). If English is not the sole language of instruction listed, if no language is listed at all, or if the institution does not appear on the WHED website, you are required to submit English proficiency exam scores. No other documentation (e.g. letters, language certificates, school websites) may be used in place of WHED as a means to obtain an exemption from the English proficiency requirement.\nThe TOEFL iBT Special Home Edition will be accepted for admission at both the Master's and PhD levels. However, the TOEFL ITP Plus for China Solution cannot be used to substitute for a standard TOEFL iBT test.\nThe UCSD TOEFL Institution Code is 4836. The university minimum TOEFL score required for admission is 550 for the paper-and-pencil version, 213 for the computer-based test, or 85 for the internet-based test (iBT).\nThe university minimum IELTS score required for admission is Band Score 7. To submit official test scores to UC San Diego Graduate Division, applicants must contact the IELTS test center where they took the test to request their official test results to be sent to the address below. UC San Diego does not accept unofficial copies of IELTS Test Report Forms from students. An institution code is not required.\nUniversity of California, San Diego Graduate Admissions\n9500 Gilman Drive #0003\nLa Jolla, CA 92093-0003\nFor more information on the TOEFL, visit the TOEFL website. An official ETS-reported score must be submitted for an applicant to be admitted into the graduate program. The Test of Spoken English (TSE) is not required. \n7. RESUME/CV:\nA resume or curriculum vitae should be uploaded to the online application under the Resume/CV section.\nRequests to update Resumes and/or the Statement of Purpose are not granted after submission. Please carefully double-check edits prior to official submission.\n8. CURRENTLY ENROLLED UCSD STUDENTS\nUCSD Student PID #: Please enter your UCSD student PID in the application. \n*Attention: Current/Former UCSD Students Seeking PhD Admission. If you are a current or former UCSD student and wish to continue or transfer to the PhD program, please follow these steps:\n  APPLICATION PROCESS:\nComplete the UCSD Application for Graduate Admission by the general application deadline for the year you are seeking admission. Please note that admission is only offered in the Fall quarters.\nYour application will be reviewed alongside those of external PhD applicants for that admissions cycle.\nONLINE APPLICATION SUBMISSION:\nMS to PhD students must complete their application online.\nImportant: Do not click on the \"submit\" button after completing your online application\nNOTIFICATION EMAIL:\nAfter completing your online application, send an email to csegradinfo-phd@ucsd.edu to notify the admissions team about your application.\nIn the subject line of the email, please include \"MS to PhD Transfer Application Submission.\"\nSUPPLEMENTAL MATERIALS:\nEnsure you have provided all the necessary supplemental materials required for the graduate application. For a detailed list, please visit our Graduate Application Checklist.\nRequired materials only for MS to PhD Transfer Application: \nTranscripts (please submit an unofficial copy of your UCSD Graduate transcript)\nStatement of Purpose (see #3 above)\nThree Letters of Recommendation  (see #4 above)\nResume/CV  (see #7 above)\n**Note: MS to PhD transfer students, as a current/former UCSD student, you will not be charged an application fee.**\nContact Information\nIf you still have questions for which you could not find an answer on our website, please email either one of the following:\nPhD Admissions at csegradinfo-phd@ucsd.edu\nMS Admissions at csegradinfo-ms@ucsd.edu\nThe University of California, San Diego does not discriminate on the basis of race, color,  national origin, religion, sex, disability, age or sexual orientation in any of its policies,  procedures, or practices, including but not limited to academic admission, financial aid, educational services, and student employment.\nINFORMATION\nProspective Students\nCareer Connections\nAlumni\nHealth & Safety\nEmergency Action Plan\nQUICKLINKS\nFaculty Recruitment\nCSE Diversity, Equity & Inclusion\nPublications\nSTAY CONNECTED\nDept of Computer Science and Engineering\nUniversity of California, San Diego\n9500 Gilman Drive\nLa Jolla, CA 92093-0404  U.S.A.\nSOCIAL MEDIA\n© 2025 Regents of the University of California. All rights reserved. Accessibility | Privacy | Terms of Use",
        "tags": [
            "cs",
            "2025",
            "ms",
            "uc_san_diego"
        ]
    },
    {
        "id": "university_of_pennsylvania",
        "title": "University of Pennsylvania - MSCS Deadlines",
        "text": "Current Students\nFaculty\nStaff\nAlumni\nApply\nMake a Gift\nSearch\nComputer and Information Science\nA Department of the School of Engineering and Applied Science\nAcademics\nResearch\nPeople\nCommunity\nAbout\nGraduate Program Offerings Master of Computer and Information Technology\nMaster of Computer and Information Technology Program\nPlease note: this is the on-campus information; for the online MCIT, please see the program website.\nProgram Overview\nThe Master of Computer and Information Technology (MCIT) program is a rigorous graduate-level program that gives talented students who have no prior experience in Computer Science an opportunity to embark on a highly successful career in computing and technology, often in coveted interdisciplinary roles or even in purely technical software development positions. The MCIT program stems from a belief that advanced computer science coursework for people with undergraduate degrees in other diverse fields leads to highly successful career paths. Our graduates and their careers today stand as strong proof to this philosophy. Within the realm of academia, pursuing further advanced study in computer science is also an option open to MCIT graduates.\nDue to the goals and nature of the MCIT program, it is strictly for applicants with limited or no past experience in computer science. Candidates with an undergraduate major in Computer Science or closely related fields, should consider applying to the Master of Science in Engineering (MSE) program instead.\n  To learn more about the application and admission requirements please visit:\nHow Do I Apply?\nVisit the Graduate Admissions website for additional FAQs.\nDegree Requirements\nOur Students\nOur students come from backgrounds as diverse as chemistry, history, medicine, law, mathematics, literature and fine arts. However, what they all share in common is immense drive and a strong desire to succeed in the field of computing and technology. With their unique combination of skills in Computer Science and non-Computer Science fields, they have gone on to succeed in both technical and interdisciplinary careers. Moreover, current students are very well connected with our tight-knit alumni community, and the MCIT network is growing with each graduating batch.\nWhat Should I Expect After Graduation?\nMCIT graduates emerge from the program as well-rounded and versatile individuals, and find themselves in a prime position in the job market. Past students have gone on to work in various roles at large companies like Google, Microsoft and Facebook, as well as at entrepreneurial start-ups and smaller-sized companies across the nation. Moreover, with their diverse backgrounds, our students are also in a unique position to fill technical jobs in industries such as bioinformatics, medicine, finance, telecommunications, media and many others. A significant proportion of our students do internships in the summer between their first and second years of study, and these internships often lead to full-time employment offers. Our accessible and tight-knit alumni network, together with Penn’s stellar Career Services and our supportive, reputed faculty, ensure that MCIT graduates are exposed to the many doors that are open to them after graduation.\nProgram FAQ\nWho should apply to the MCIT program?\nWhat if I have an undergraduate degree in Computer Science, Computer Engineering, etc.? Or prior software development experience? Should I apply anyway?\nWhat will I study?\nWhat is the policy regarding course transfers and waivers?\nCan I be a part-time student?\nCan I start in the spring semester?\nHow likely am I to succeed in this new field?\nWhat is the application process like?\nGraduate Program:\nProgram Offerings\nDoctoral Program\nMSE in CIS\nMaster of Computer and Information Technology\nMSE in Data Science\nMSE in Embedded Systems (EMBS)\nMSE in Robotics\nMSE in Computer Graphics and Game Technology\nHow to Apply\nAdmissions Statistics\nFellowships + Aid\nAdvising\nNew Students\nHow to Register\nHandbook\nForms\nTutoring\nGraduation + Thesis Information\nResources\nAcademic + Industry Job Postings\nYour CIS Contacts:\nRedian Furxhiu\nProgram Manager for on-campus Graduate MCIT, CIS/MSE and CGGT programs\nOffice: 308 Levine\nPhone: 215-898-1668\nEmail: redian@seas.upenn.edu\nStaci Kaplan\nProgram Manager for DATS (Data Science MSE)\nOffice: 308 Levine\nPhone: 215-573-2431\nEmail: stacilk@seas.upenn.edu\nBritton Carnevali\nDoctoral Program Manager\nOffice: 310 Levine\nPhone: 215-898-5515\nEmail: brittonc@cis.upenn.edu\nMariel Celentano\nGraduate Coordinator for ROBO\nOffice: 459 Levine\nPhone: 215-573-4907\nEmail: robo-coord@seas.upenn.edu\nJulia Esposito\nPICS Program Coordinator, SCMP Academic Coordinator\nOffice: 3401 Walnut, 5th Fl.\nPhone: 215-573-6037\nEmail: jnespos@seas.upenn.edu\nQuick Actions\nPENN ENGINEERING©2017 |UNIVERSITY OF PENNSYLVANIA|SCHOOL OF ENGINEERING AND APPLIED SCIENCE | DEPARTMENT OF COMPUTER AND INFORMATION SCIENCE\n3330 Walnut Street | Levine Hall | Philadelphia, PA 19104-6309 | 215-898-8560\nContact us with questions about the academic programs |Graduate Admissions information contact SEAS Graduate Admissions |For website issues, email the webmaster\nReport accessibility issues and get help",
        "tags": [
            "cs",
            "2025",
            "ms",
            "university_of_pennsylvania"
        ]
    },
    {
        "id": "university_of_chicago",
        "title": "University of Chicago - MSCS Deadlines",
        "text": "Skip to content\nTHE UNIVERSITY OF CHICAGO\nRequest Information\nApply\nContact Us\nAdmissions\nAcademics\nStudent Resources\nCareer Services\nAbout\nSearch\nAdmissions\nRequest More Information\nVisits and Appointments\nApplication Requirements\nDates and Deadlines\nTuition and Fees\nFrequently Asked Questions\nDates and Deadlines\nOur admissions timeline is designed to provide flexibility and support as applicants prepare to embark on a path toward their career goals. Whether applying from across the nation or around the globe, staying informed about our key deadlines will help ensure a smooth application process. Explore the dates below to keep track of important milestones in the admissions and enrollment process.\nPlease Note: All deadlines are at 11:59 p.m. Central Time on the date listed.\nFull-Time MS in CS Program (9-Course and 12-Course)\nRound Application Deadline Decision Release\nRound 1 December 4, 2024 Late January 2025\nRound 2 February 5, 2025 Late March – Early April 2025\nRound 3 July 2, 2025 Rolling\nImportant Notes:\nThe Round 3 deadline is open to U.S. Citizens, Permanent Residents, and individuals residing in the U.S. on a valid visa. Availability in Round 3 may be limited based on the yield from Rounds 1 and 2. Applications will be considered after July 2, 2025 if space permits. To check availability before starting an application, please contact the admissions team.\nAll deadlines are at 11:59 p.m. Central Time on the date listed.\n  Part-Time MS in CS Program (9-Course and 12-Course)\nRound Application Deadline Decision Release\nWinter November 6, 2024 Rolling\nSpring January 8, 2025 Rolling\nSummer April 2, 2025 Rolling\nAutumn August 6, 2025 Rolling\nImportant Notes:\nPart-time applications can be submitted at any time before the final deadline for the intended start quarter. Applications are reviewed on a rolling basis, and decisions are typically made within 2-4 weeks after the application is complete and all required documents have been received. Late applications will be accepted as space and timing permits.\nPart-time study is available to U.S. Citizens, Permanent Residents, and individuals residing in the U.S. on a valid visa. Please note that student visa sponsorship is not available for part-time students.\nWinter, Spring, and Summer quarter starts are not always available. The availability of these quarters may depend on the course plan, placement exam results, and programming background. For guidance on course planning and determining the best quarter to begin studies, please contact the admissions office.\nAll deadlines are at 11:59 p.m. Central Time on the date listed.\nAdditional Programs\nFor the Joint MBA/MPCS program, please visit Chicago Booth’s Admission Page and apply to the Joint MBA/MPCS Program adhering to their application deadlines and requirements.\nFor the Advanced Scholars 4+1 program, please visit UChicago Career Advancement for information on applying for admission.\nMasters Program in Computer Science\nJohn Crerar Library\n5730 South Ellis Avenue, Floor 3\nChicago, Illinois. 60637\nAdmissions\nAcademics\nCareer Services\nAbout\nDepartment of Computer Science\nPhysical Sciences Division\nAccessibility\nNon-Discrimination Statement\nPrivacy Notice\n© University of Chicago - All Rights Reserved",
        "tags": [
            "cs",
            "2025",
            "ms",
            "university_of_chicago"
        ]
    },
    {
        "id": "university_of_southern_california",
        "title": "University of Southern California - MSCS Deadlines",
        "text": "Admission & Student Engagement\nProspective Graduate Students\nPrograms\nDEN@Viterbi\nNewly Admitted\nEvents\nPartners\nAbout\nContact\nHOME\nPROGRAMS\nMASTER’S\nMASTER’S PROGRAMS\nCOMPUTER SCIENCE\nComputer Science\nNENO MEDVIDOVIĆ PROFESSOR & CHAIR\n“The USC Viterbi School of Engineering offers one of the best environments for interdisciplinary research and international collaboration in the nation. As an alumnus, I am proud of the record of innovation in our department and its affiliated centers: The Domain Name System and the TCP/IP protocols, the invention of DNA computing, and historic interdisciplinary studies relating brains, machines and mathematics. A former student wrote one of the first computer viruses and led the theoretical study of the computer virus concept.\nI am equally proud of the accomplishments of our current faculty, including path-setting results in social networks, software engineering, high-performance computing, natural language technologies, and the recent Academy award winning work in computer graphics. Their profound and diverse research and educational contributions to a wide array of computer science and interdisciplinary arenas are impressive. As a USC Computer Science student, you can be sure to take advantage of the incredible resources and frequent opportunities that will come your way.”\nIt’s been an exciting year for USC’s Department of Computer Science! See some of our faculty and student highlights, learn more about our new hires and research funding awards in this handy fact sheet.\nDepartment Newsletter\nMaster's Programs\nMaster's Degree Programs\nAvailable On-Campus\nAvailable Online\nAvailability\nComputer Science (CS)\nFall/Spring/Summer\nCS-Artificial Intelligence\nFall/Spring/Summer\nCS-Data Science\nFall/Spring/Summer\nCS-Game Development\nFall Only\nCS-Scientists and Engineers\nFall/Spring\nPUBLISHED ON JUNE 9TH, 2017\nLAST UPDATED ON FEBRUARY 4TH, 2025\nContact Us\nVisit Us\nOther USC Links\nUniversity of Southern California\nViterbi School of Engineering\nFor Prospective Graduate Students\nPrograms\nDEN@Viterbi\nPartners\nNewly Admitted\nVirtual Tour\nViterbi Admission & Student Engagement\nCurrent Graduate Students\nProspective Graduate Students\nExecutive Education\n© 2025 USC Viterbi\nPrivacy Notice | Notice of Non-Discrimination | Digital Accessibility | Smoke-Free Policy",
        "tags": [
            "cs",
            "2025",
            "ms",
            "university_of_southern_california"
        ]
    },
    {
        "id": "university_of_michigan–ann_arbor",
        "title": "University of Michigan–Ann Arbor - MSCS Deadlines",
        "text": "Giving\n|\nAlumni\nAbout\nCommunity\nAcademics\nResearch\nPeople\nNews\nEvents\nAcademics\nGraduate—\nHear from our Students\nPrograms+\nAdmissions—\nHow to Apply\nFunding\nExternal Fellowships\nAdmissions FAQs\nAdvising+\nCurrent PhD Students\nCurrent Master’s Students\nConnect with the Graduate Programs Office\nInternship Guidelines\nProfessional Coaching\nGrad Student Resources ↗\nAnnual Workshop for Prospective Students\nUndergraduate+\nCourse Resources+\nHome > Academics > Graduate > Graduate Admissions\nGraduate Admissions\nApply for graduate study in CSE\nThe application for graduate admission reopens in mid-September and is completed online through the Rackham Graduate School. Please note that all admissions are for the fall term.\nClick here to apply >\nHow to apply\nThe CSE graduate program is part of the University of Michigan’s Horace H. Rackham School of Graduate Studies.\nOnline application instructions >\nFrequently asked questions >\n\nGRE scores are not considered in the admissions review of PhD or Master’s applications.\n\nCSE Faculty\nProspective students may reach out to CSE faculty members who they are interested in working with to ask about related research areas.\nIn general, if you do not see a specific faculty member listed in the application dropdown, please include their name in another area of the application (e.g. the statement of purpose or the Additional Information section). The application can be searched by faculty using keywords and they will be able to find applicants that indicated their names within the application.\nFee waiver – PhD Applicants\nThis application has closed (deadline was Nov. 24).\nFee Waiver Deadline\nNovember 24, 2024 at 11:59 PM EST (different than graduate application deadline)\nYou will be notified by December 9, 2024 (EST) whether or not you have received a fee waiver. Applicants may start the graduate application (including reaching out to recommenders) prior to fee waiver notification (the application allows one to save progress and make edits prior to submitting).\nDue to limited resources, we will not be able to provide fee waivers for everyone who applies. We recommend prospective applicants also check out the fee waivers offered by Rackham Graduate School.\nThis is not a reimbursement program – fee waivers must be used at the time of submitting the Rackham ApplyNet application. We cannot reimburse application fees after submission.   \nQuestions? Email csegradapply@umich.edu\nFee waiver – Master’s Applicants\nUnfortunately, our program is unable to provide fee waivers for Master’s applicants this admissions cycle. We recommend prospective applicants check out the fee waivers offered by Rackham Graduate School.  \nApplication deadlines\nPhD Application Deadline Master’s Application Deadline\nDecember 15th, 11:59 PM ET January 15th, 11:59 PM ET\nFor full admission and financial aid consideration, applications to the doctoral program must be completed and submitted by December 15th.\n\nFor full admission consideration, applications to the master’s program must be completed and submitted by January 15th.\nNeither the PhD program nor the terminal Master’s program admit students for the Winter or Spring/Summer terms.\nAt the graduate level, admitted students are notified via email from February through April. If accepting the offer of admission, doctoral admits must email their signed acceptance to csegradapply@umich.edu and respond to the email from Rackham Admissions by April 15th. Master’s admits accepting the offer must respond to the email from Rackham Admissions by May 1st.\nPlease note that the Rackham Graduate Application closes during the summer and will open back up for the new admissions cycle in late August/early September.\nSequential Undergraduate/Graduate Study (SUGS) program\nSUGS is open to current U of M undergraduate students only.\nSUGS program applications must be submitted and completed by:\nJanuary 15 (fall term)\nOctober 1 (winter term)\nDual Degree Admission\nCurrent Rackham students seeking dual admission to the CSE Terminal Master’s program should review Rackham’s Dual Admission guidance.\nSuccessful applicants have typically completed at least three 500-Level EECS Courses earning a grade of ‘B’ or better and are sufficiently prepared to complete the Program requirements outlined in section 3 of CSE’s Graduate Program Guide, available here. In addition to completing Rackham’s Dual Admission Application process, applicants should include as a part of their application:\nCV or resume\nStatement of Purpose and Personal Statement\n1 Letter of Recommendation from a CSE faculty member\nDeadlines for admissions consideration:\nJanuary 15 (fall term)\nOctober 1 (winter term)\nEligibility requirements\nWe expect applicants to both the Master’s and PhD programs to have earned their bachelor’s degrees by the time they matriculate, and to possess strong backgrounds in computer science or a related discipline. A master’s degree is not required to apply to the PhD program.\nIf your degree is from a non-US institution, verify if your degree meets our bachelor’s degree requirement here\nIf you have a MS or PhD in computer science or an equivalent field from another institution, you cannot apply for the same degree at the University of Michigan\nSuccessful applicants usually have an undergraduate GPA of at least 3.5/4.0 (although this is not a hard requirement) and three strong letters of recommendation. International students must demonstrate English proficiency. Further information about English Proficiency as well as exemption requirements may be found here.\nStudents admitted to the PhD program generally exceed these standards. In addition, students admitted to the PhD program often have prior research experience or have demonstrated research aptitude.\nFunding\nWe guarantee PhD students full funding as long as they are making satisfactory progress towards the degree. Admission to the M.S. program is not accompanied by funding, but there are opportunities for financial support after beginning the program.\nFunding information\nU-M tuition and fees\nContact Us\nContact us with any questions about Computer Science and Engineering graduate programs.\ncsegradapply@umich.edu\nComputer Science and Engineering\nBob and Betty Beyster Building\n2260 Hayward Street\nAnn Arbor, MI 48109-2121\nDidn't find what you were looking for? Contact Us\nFaculty and Staff Resources: CSE Intranet\nComputer Science and Engineering is one of two divisions in the Department of Electrical Engineering and Computer Science. The other is Electrical and Computer Engineering. We are part of the College of Engineering at the University of Michigan.\n© 2025 The Regents of the University of Michigan\nPrivacy Policy\nCampus Safety\nNon-Discrimination Policy",
        "tags": [
            "cs",
            "2025",
            "ms",
            "university_of_michigan–ann_arbor"
        ]
    },
    {
        "id": "uc_santa_barbara",
        "title": "UC Santa Barbara - MSCS Deadlines",
        "text": "Skip to main content\nUniversity of California, Santa Barbara\nINFORMATION FOR\n.st0{fill:#003764;}\nMain navigation\nAbout\nResearch\nEducation\nDiversity Equity & Inclusion\nPeople\nHappenings\nGive\nOpen Positions\nGraduate\nGraduate Menu\nOverview\nPhD Degree\nMS Degree\nBS/MS Combined Degree Program\nHow to Apply\nResources\nContact\nHow to Apply\nIn addition to fulfilling the Graduate Division requirements for admission, the Department of Computer Science requires a bachelor's degree in some discipline of science, engineering, or mathematics.\nPlease see the information below for additional points to consider as you prepare your PhD application. For questions related to the online application, don't forget to check the Frequently Asked Questions (FAQ) provided by the UCSB Graduate Division. The department receives thousands of applications every year and the review process starts very quickly after the application deadline. Therefore, all required application materials must be received by the admission deadline in order for the application to be considered complete for review.\nFrequently Asked Questions\nOnline Application\nApplications to the UCSB Computer Science MS and PhD programs are accepted once per year. All applications should be submitted through the Graduate Division’s on-line application.\nIf you're from an underrepresented or marginalized background in CS, take advantage of our new PhD Application Support Program, designed to guide and refine your application materials with insights from trained mentors.\nMinimum Requirements for All Graduate Applications\nGrade-point Average\nA minimum of a 3.0 cumulative GPA in undergraduate study. During the review process, we re-calculate GPAs into context on a per-school basis for institutions that do not use a 4.0 GPA scale.\nGraduate Record Examination (GRE)\nThe department does not currently require the GRE for any applicants. Because the GRE is not a requirement, we are prohibited from reviewing test scores for all applicants. Do not attempt to upload GRE scores to your application as they will not be reviewed. Further information is listed on the Graduate Division FAQ page.   \nNon-native English Speakers (or ESL Students)\nApplicants whose native language is not English are required to take the TOEFL or IELTS or Duolingo English Test (DET). The department requires a higher minimum score on certain tests than the University minimum score requirements; the department minimums are listed on the Graduate Division CS Department webpage. \nFurther information on the type of English language exams UCSB accepts is listed on the Graduate Division FAQ page and Graduate Division How to Apply page.\nExemptions from the English language exam requirement are permitted for applicants who have completed an undergraduate (bachelor's or equivalent) or graduate (master's, doctoral, or equivalent) degree at an institution where the verified sole official language of instruction is English. Further information on how exemptions are verified after the application deadline and during the review process is listed on the Graduate Division FAQ page.  \nAdditional Information Specific to PhD Admissions\nStudents may apply directly to the PhD program without a Master's degree. \nApplicants to the PhD program generally have a grade-point average of at least 3.5 in their undergraduate study.\nStudents entering this program should be committed to completing a PhD. The department discourages students petitioning to switch to the Master's program; such petitions are approved only under exceptional circumstances.\nCurrent UCSB Graduate Students\nTo switch to or add a Computer Science Masters of Science (MS) degree objective, please submit the Graduate Student Petition available on the Graduate Division website and supporting materials to the Computer Science Department Staff Advisor via email by the annual December 15 deadline. Do not complete the on-line application. Petitions & materials are reviewed along with the other graduate school applications received. Our department asks that you complete 3 of our CS graduate courses before applying to our MS program. CS graduate courses may only be added through approval codes by non-CS majors.\nTo switch to or add a Computer Science Doctor of Philosophy (PhD) degree objective, please complete the on-line application by the annual December 15 deadline. Do not complete the Graduate Division Graduate Student Petition. Only PhD applications and materials received via the on-line application portal will be reviewed. \nFinancial Support\nAll PhD applicants are considered for campus and departmental fellowships, including but not limited to, the Doctoral Scholar Fellowship, Chancellor's Fellowship, Regents Fellowship, and the Eugene Cota Robles Fellowship.\nAdmitted PhD students are typically offered financial support consisting of student employment, based on meeting all of the necessary eligibility criteria including academic good standing and department program requirements. PhD students may be funded by a combination of Fellowship awards, Graduate Student Researcher employment positions (GSRs), and/or Teaching Assistant employment positions (TAs).\nMS students may apply for TA positions each quarter and may be employed as GSRs upon availability with a faculty member.\n  Teaching Assistants (TAs)\nThe department accepts applications for Teaching Assistants (TAs) each quarter. The application website is available approximately 2 months prior to the start of a quarter. Priority for employment is given to first and second-year CS PhD students. TAs receive partial fee remission through their employment, along with a salary for their job duties. In addition, the department will pay Non-Resident Supplemental Tuition (NRST) for PhD students who are international students or domestic non-California resident students for the first year. Domestic PhD students MUST secure California residency prior to their second year. MS students who are TAs are responsible for paying their own NRST fees by the fee payment deadline. The department does not pay for the cost of housing or living expenses for any students.\nGraduate Student Researchers (GSRs)\nIt is anticipated that CS PhD students will transition to Graduate Student Researcher (GSR) positions during their second year. Students are hired by their research advisors to conduct research in the lab. GSRs receive either partial or full fee remission through their employment based on the percentage of their appointment. \nFellowships\nThere are several fellowships for which the department annually nominates students. These fellowships include the Microsoft Research Fellowship, the Google PhD Fellowship, the IBM PhD fellowship, and a number of centrally administered university fellowships. Students interested in being considered for these awards should talk to their research advisors about a nomination. The Graduate Division offers a number of fellowships for which students may apply after their first year at UCSB. These fellowships include research fellowship awards and a dissertation year fellowship. Information about funding opportunities can be found at the Graduate Division website. \nUCSB Computer Science\n2104 Harold Frank Hall\nSanta Barbara, California 93106-5110\nCONNECT\nFacebook\nTwitter\nLinkedIn\nInstagram\nHELPFUL LINKS\nPay and Service Period Chart\nVisiting\nCareers\nPolicies & Disclosures\nINFORMATION FOR\nTechnical Support\nFacilities\nRoom Schedules & Reservations\nEmergency & Safety Information\nFamily Resources\nBudget, Travel, & Reimbursements\nCopyright © 2025 The Regents of the University of California. All Rights Reserved. Terms of Use Accessibility",
        "tags": [
            "cs",
            "2025",
            "ms",
            "uc_santa_barbara"
        ]
    },
    {
        "id": "uc_davis",
        "title": "UC Davis - MSCS Deadlines",
        "text": "Skip to main content\nOpen Search\nQuick Links\nAbout\nAdmissions\nAcademics\nFinancial Support\nInclusion & Belonging\nResources\nApplication Deadlines\nBreadcrumb\nHome\nAdmissions\nPrepare\nApplication Deadlines\ndistinguished\nExplore\nPrepare\nApply\nAdmitted Students\nThe 2025-26 Graduate Admissions Applicationis open.\nDeadline Types\nPriority Deadline will receive priority review for admission. If the program has a priority deadline listed, you must apply by this deadline to be considered for internal fellowships. \nGeneral Deadline will be reviewed by the graduate program but not on a priority basis.\nSpace Available Deadline will only be reviewed if the graduate program determines that they have additional space available after reviewing priority and general deadline applications.\nPlease Note: * denotes the admissions deadline used as the prospective student fellowship deadline. \nApply by the Program's Priority Deadline to Qualify for Fellowships\nProspective Student Fellowship Deadlines\nGraduate Studies administers approximately $6.6 million dollars in internal fellowships annually. The only way to be considered for these fellowships is to apply by your program's priority deadline. \nLetters of recommendation may be submitted after the application deadlines, but program review timelines vary. Contact the program's Graduate Coordinator or visit the program's website for information on their timeline.\nApplications close after 11:59 p.m. (Pacific Time) on the day of the deadline.\nGRE Test Requirements\nFor Fall 2025 admissions, the GRE is not required or accepted by the majority of our graduate programs. International students may be required to complete English language proficiency testing. View the international students page for more details. \nPlease Note: * denotes the admissions deadline used as the prospective student fellowship deadline. \nPROGRAM DEGREE(S) PRIORITY DEADLINE GENERAL DEADLINE SPACE AVAILABLE DEADLINE TEST REQUIREMENT\nAgricultural and Environmental Chemistry\nMaster's\nPh.D. January 5* June 1 Not Available GRE not required or accepted\nAgricultural and Resource Economics\nMaster's\nPh.D. January 5* April 15 Not Available GRE required \nAnimal Behavior\nPh.D. Not Available December 1* June  1 GRE not required or accepted\nAnimal Biology\nMaster's\nPh.D. January 15* May 1 June 1 GRE not required or accepted\nAnthropology\nMaster's\nPh.D. Not Available December 15* March 15 GRE not required or accepted\nApplied Mathematics\nMaster's\nPh.D. Not Available January 5* June 1 GRE not required or accepted\nArt\nMaster's Not Available January 5* Not Available GRE not required or accepted\nArt History\nMaster's Not Available December 15* June 1 GRE not required or accepted\nAtmospheric Science\nMaster's\nPh.D. Not Available January 5* June 1 GRE not required or accepted\nAvian Sciences\nMaster's Not Available Not Available Not Available GRE required\nBiochemistry, Molecular, Cellular and Developmental Biology\nPh.D. Not Available December 1* Not Available GRE not required or accepted\nBiological Systems Engineering\nMaster's    \nPh.D.\nD.Engr. December 15* March 15 May 15 GRE not required or accepted\nBiomedical Engineering\nMaster's \nPh.D. Not Available December 1* June 1 GRE not required or accepted\nBiophysics\nPh.D. Not Available December 1* January 5 GRE not required or accepted\nBiostatistics\nMaster's \nPh.D. December 15* March 15 May 15 GRE required\nChemical Engineering\nMaster's \nPh.D. Not Available January 15* June 1 GRE not required or accepted\nChemistry and Chemical Biology\nPh.D. Not Available December 1* May 1 GRE not required or accepted\nChild Development\nMaster's  Not Available December 1* March 1 GRE not required or accepted\nCivil and Environmental Engineering\nMaster's \nPh.D. December 15* February 1 June 1 GRE not required or accepted\nClinical Research\nMaster's Not Available March 15 June 1 GRE not required or accepted\nCommunication\nMaster's \nPh.D. December 1* February 1 Not Available GRE not required or accepted\nCommunity Development\nMaster's Not Available January 15* Not Available GRE not required or accepted\nComparative Literature\nMaster's \nPh.D. January 5* January 15 June 1 GRE not required or accepted\nComputer Science\nMaster's \nPh.D. Not Available December 15* Not Available GRE not required or accepted\nCreative Writing\nMaster's Not Available January 5* Not Available GRE not required or accepted\nCultural Studies \nPh.D. Not Available December 15* Not Available GRE required\nDesign\nMaster's Not Available January 15* April 1 GRE not required or accepted\nEarth and Planetary Sciences \nMaster's \nPh.D. Not Available January 5* May 1 GRE not required or accepted\nEcology\nMaster's \nPh.D. Not Available December 1* Not Available GRE not required or accepted\nEcology (Joint Program with San Diego State University)\nPh.D. Not Available December 1* Not Available GRE not required or accepted\nEconomics\nMaster's \nPh.D. Not Available December 15* Not Available GRE required\nEducation (Credential/M.A.)\nMaster's January 15 March 1 April 1 GRE not required or accepted\nEducation (Ph.D.)\nPh.D. Not Available December 15* Not Available GRE not required or accepted\nEducational Leadership (CANDEL)\nEd.D. Not Available February 1 Not Available GRE not required or accepted\nElectrical and Computer Engineering\nMaster's \nPh.D. Not Available January 15* June 1 GRE not required or accepted\nEnergy Systems\nMaster's \nPh.D. January 15* April 1 June 1 GRE not required or accepted\nEnglish\nPh.D. Not Available January 5* Not Available GRE not required or accepted\nEntomology\nMaster's \nPh.D. Not Available January 5* Not Available GRE not required or accepted\nEnvironmental Policy and Management\nMaster's Not Available January 5* April 15 GRE not required or accepted\nEpidemiology\nMaster's \nPh.D. December 15* February 15 Not Available GRE not required or accepted\nFood Science\nMaster's \nPh.D. Not Available December 1* Not Available GRE not required or accepted\nForensic Science\nMaster's Not Available February 1 June 1 GRE not required or accepted\nFrench and Francophone Studies\nMaster's \nPh.D. Not Available January 15* June 1 GRE not required or accepted\nGeography\nMaster's \nPh.D. Not Available January 5* Not Available GRE not required or accepted\nGerman\nMaster's \nPh.D. January 15* April 1 May 1 GRE not required or accepted\nHealth Informatics\nMaster's January 15* March 1 June 1 GRE not required or accepted\nHistory\n Ph.D. Not Available January 5* Not Available GRE not required or accepted\nHorticulture and Agronomy\nMaster's \nPh.D. January 5* March 15 May 1 GRE not required or accepted\nHuman Development\nPh.D. Not Available December 1* March 1 GRE not required or accepted\nHydrologic Sciences\nMaster's \nPh.D. January 5* May 1 Not Available GRE not required or accepted\nImmunology\nMaster's \nPh.D. Not Available December 1* June 1 GRE not required or accepted\nIntegrative Genetics and Genomics\nMaster's \nPh.D. Not Available December 1* Not Available GRE not required or accepted\nIntegrative Pathobiology\nMaster's \nPh.D. Not Available December 1* March 1 GRE not required or accepted\nInternational Agricultural Development\nMaster's December 15* April 15 May 15 GRE not required or accepted\nLinguistics\nMaster's \nPh.D. Not Available December 15* Not Available GRE not required or accepted\nMaterials Science and Engineering\nMaster's \nPh.D. Not Available January 15* June 1 GRE not required or accepted\nMaternal and Child Nutrition\nMaster's February 15 April 15 June 1 GRE not required or accepted\nMathematics\nMaster's \nPh.D. Not Available January 5* June 1\nGeneral GRE not required or accepted. \nMathematics Subject GRE OPTIONAL\nMechanical and Aerospace Engineering\nMaster's \nPh.D. December 15* January 15 April 1 GRE required\nMedical Device Development\nMaster's January 15 January 15* June 1 GRE not required or accepted\nMicrobiology\nMaster's \nPh.D. Not Available December 1* June 1 GRE not required or accepted\nMolecular, Cellular and Integrative Physiology\nMaster's \nPh.D. Not Available December 1* Not Available GRE not required or accepted\nMusic\nMaster's \nPh.D. Not Available January 5* February 15 GRE not required or accepted\nNative American Studies\nMaster's \nPh.D. Not Available December 1* Not Available GRE not required or accepted\nNeuroscience \nPh.D. Not Available December 1* Not Available GRE not required or accepted\nNursing (Doctor of Nursing Practice - Family Nurse Practitioner) \nD.N.P. January 5 January 15 June 1 GRE not required or accepted\nNursing (Doctor of Nursing Practice - Nurse Anesthesia)\nD.N.P. January 5 January 15 May 1 GRE not required or accepted\nNursing (Master's Entry Program in Nursing)\nMaster's Not Available January 15 Not Available GRE not required or accepted\nNursing Science and Health-Care Leadership (Ph.D.)\nPh.D. Not Available January 15* June 1 GRE not required or accepted\nNutritional Biology\nMaster's \nPh.D. December 15* January 15 Not Available GRE not required or accepted\nPerformance Studies\nPh.D. December 1* January 15 June 1 GRE not required or accepted\nPharmaceutical Chemistry\nMaster's Not Available December 1* May 1 GRE not required or accepted\nPharmacology and Toxicology\nMaster's \nPh.D. Not Available December 1* Not Available GRE not required or accepted\nPhilosophy\nMaster's \nPh.D. Not Available January 15* May 1 GRE not required or accepted\nPhysician Assistant Studies\nMaster's Not Available December 1 Not Available GRE not required or accepted\nPhysics\nMaster's \nPh.D. December 15 January 15* June 1 GRE not required or accepted\nPlant Biology\nMaster's \nPh.D. Not Available December 1* June 1 GRE not required or accepted\nPlant Pathology\nMaster's \nPh.D. Not Available January 5* Not Available GRE not required or accepted\nPolitical Science\nMaster's/J.D. \nPh.D.           Not Available December 15* February 1 GRE required\nPopulation Biology\nPh.D. Not Available December 1* Not Available GRE not required or accepted\nPreventive Veterinary Medicine\nMaster's Not Available January 15 June 1 GRE not required or accepted\nPsychology\nMaster's \nPh.D. Not Available December 1* June 1 GRE not required or accepted\nPublic Health (MPH)\nMaster's December 1* January 15 June 1 GRE or MCAT not required or accepted\nPublic Health Sciences (Ph.D.)\nPh.D. December 1* January 15 June 1 GRE not required or accepted\nSociology\nPh.D. Not Available December 15* Not Available GRE required\nSoils and Biogeochemistry\nMaster's \nPh.D. January 15* May 1 Not Available GRE not required or accepted\nSpanish\nMaster's \nPh.D. Not Available January 5* February 1 GRE not required or accepted\nStatistics\nMaster's \nPh.D. December 1* January 15 Not Available GRE required\nStudy of Religion \nPh.D. Not Available January 5* May 1 GRE not required or accepted\nTransportation Technology and Policy\nMaster's \nPh.D. January 15* April 1 June 1 GRE not required or accepted\nViticulture and Enology\nMaster's Not Available January 15* May 15 GRE not required or accepted\nUC Davis Graduate Studies\n2001 Walker Hall | One Shields Avenue\nDavis, CA 95616\nContact Us\nWeb Requests\nYour gift makes an impact.\nGive to Grad Studies\nFollow Us!\nPrivacy & Accessibility Principles of Community University of California\nCopyright © The Regents of the University of California, Davis campus. All rights reserved.\nThis site is officially grown in SiteFarm.",
        "tags": [
            "cs",
            "2025",
            "ms",
            "uc_davis"
        ]
    },
    {
        "id": "university_of_wisconsin–madison",
        "title": "University of Wisconsin–Madison - MSCS Deadlines",
        "text": "Cookie Notice\nWe use cookies on this site. By continuing to browse without changing your browser settings to block or delete cookies, you agree to the UW–Madison Cookie Notice.\nACCEPT COOKIE NOTICE\nSkip to main content\nUNIVERSITY of WISCONSIN–MADISON\nUW Crest .cls-1{fill:url(#Web_Shield_blend);} .cls-2{fill:#282728;} .cls-3{fill:#c5050c;} .cls-4{fill:#fff;}\nComputer Sciences\nSchool of Computer, Data & Information Sciences\nSearch\nHome Expand\nUndergraduate Expand\nGraduate Expand\nThe Student Experience Expand\nCourses Expand\nResearch Expand\nPeople Expand\nCareers Expand\nMAKE A GIFT\nMYCOMPSCI EXPAND\nTHE WISCONSIN COMPUTING IDEA\nAdmissions\nThe Department of Computer Sciences (CS), hosted within the College of Letters & Science (L&S) and the School of Computer, Data & Information Sciences (CDIS), has a number of academic programs for students looking to continue their education. Our department directly offers three graduate programs: the traditional CS MS/PhD program, the professional CS MS program (PMP), and the MS Data Engineering (MSDE) programs. We also offer a post-bachelor’s certificate program: the Professional Capstone Program (PCP).\nThere are also programs hosted in other departments in partnership with the Department of Computer Sciences: the MS Data Science and User Experience Design Capstone Certificate.\nThe General Information & FAQs section below contains admission information applicable to all department degree programs, and there are separate FAQ sections specific to individual programs.\nWe look forward to reviewing your application to study with us!\nPage Navigation\nGeneral Info & FAQs More\nTraditional CS MS/PhD FAQs More\nProfessional CS MS FAQs More\nMS Data Engineering FAQs More\nMS Data Science Info More\nProfessional Capstone Certificate Info More\nUser Experience Design Capstone Certificate Info More\nGraduate Menu\nGraduate Education More\nPrograms More\nAdmissions More\nFunding & Cost of Attendance More\nTraditional CS MS/PhD More\nProfessional CS MS More\nMS Data Engineering More\nMS Data Science More\nProfessional Capstone Certificate More\nUser Experience Design Capstone Certificate More\nGeneral Information & FAQs\nInformation in this section is applicable to all graduate degree programs the Department of Computer Sciences administers: Traditional CS MS/PhD, Professional CS MS, and MS Data Engineering.\nFor information on MS Data Science, the Professional Capstone Program, and User Experience Design Capstone Certificate, please see their respective sections below.\nThis is an accordion element with a series of buttons that open and close related content panels.\nExpand all\nCollapse all\nHow do I apply for graduate study at UW-Madison?\nCan international students apply? What should international applicants know?\nI am an international student. What should I know about English proficiency testing?\nWhere can I get more information on course requirements and curriculum for Department of Computer Sciences graduate programs?\nIs there an online option for Department of Computer Sciences graduate programs?\nHow competitive is admission to Department of Computer Sciences graduate programs?\nWhat are the admissions criteria? What are my chances of being admitted to your department?\n\nDo you have a waiting list?\nI already have an MS degree from another institution. Am I eligible to apply for graduate degree program in the Department of Computer Sciences at UW-Madison?\nWhat is the cost of attending UW-Madison?\nDoes the Department of Computer Sciences offer application fee waivers?\nDo I need to submit official transcripts with my application?\nI have transcripts from an international institution. Should I submit a translation or evaluation of my transcripts?\nDo I need to submit GRE scores?\nWhat changes can I make to my application after I submit it?\nWhen is the deadline for recommenders to submit their letters?\nI was not admitted to the program I applied for. Can my application be reconsidered? Can I receive feedback on it?\nMore questions about general admissions information? Contact us at admissions@cs.wisc.edu.\nBack to Top ↑\nTraditional MS/PhD FAQs\nThe Department of Computer Sciences offers a traditional CS MS/PhD program. This program is one track, and as such, applicants are reviewed for admission as one applicant pool regardless of their intention on pursuing the MS or PhD.\nAdmit Term: Fall semester only\nApplication Deadline: December 15\nSTEM Program: Yes\nThis is an accordion element with a series of buttons that open and close related content panels.\nExpand all\nCollapse all\nShould I apply using both the MS and PhD applications? Is there a benefit to filling out both?\nWhat are the differences in the admission process for the MS and PhD programs?\nHow are admissions decisions made, and when does application review begin?\nWhen are admissions decisions made, and how are applicants notified?\nIs funding available for this program?\nWhat are my chances of receiving financial support?\nWhat guidance do you have for my statement of purpose?\nI have been working in industry for a number of years. Can I use work references instead of academic references?\nHow important are the recommendation letters, and what should they contain?\nMy undergraduate degree was in a field other than computer sciences. Am I eligible to apply for the traditional MS or PhD program?\nIf I apply for the PhD and am not recommended for admission, can I ask to be considered for MS admission?\nThe faculty member I am interested in working with is not available to select in the application. What do I do?\nI am a current UW-Madison graduate student and would like to add the CS MS major. What is the process?\nI am a current UW-Madison graduate student in a PhD program and would like to minor in CS. What is the process?\nI am currently enrolled in a different graduate program at UW-Madison. Can I change my major to a PhD in CS?\nMore questions about Traditional MS/PhD admissions? Contact us at admissions@cs.wisc.edu.\nBack to Top ↑\nProfessional CS MS FAQs\nThe Professional Master’s Program (PMP) in the Department of Computer Sciences is a distinct program from the traditional MS/PhD track and has a separate admissions process. PMP is a terminal MS program. It targets working professionals who want to pursue an MS degree to further educate themselves, obtain cutting-edge knowledge in the fast-moving IT field, apply what they learn to their jobs, and seek career advancement.\nAdmit Term: Fall semester only. (Spring semester application open only for POP admits.)\nApplication Deadline: February 15\nSTEM Program: Yes\nThis is an accordion element with a series of buttons that open and close related content panels.\nExpand all\nCollapse all\nWhat is the difference between PMP and the traditional MS program?\nWhat does the PMP admissions committee look for in an application? Am I qualified to apply?\nWhen are admissions decisions made, and how are applicants notified?\nMust I be a working professional or have professional experience to apply to PMP? Will my professional experience be taken into consideration with my application?\nIs funding available for this program?\nCan I apply to both the traditional MS/PhD program and PMP?\nWhat kind of MS degree do PMP graduates receive?\nWhat guidance do you have for my statement of purpose?\nWhat guidance do you have for my letters of recommendation?\nWhat if once in the PMP program, I change my mind and want to work toward a PhD?\nHow long does it take to complete the program? Do you offer many courses in the evening?\nCan I pursue an internship during PMP?\nHow does course advising work?\nCan admitted students pursue another graduate program with PMP?\nI'm a current UW-Madison undergraduate interested in PMP. Does the CS Department offer a pathway to admission?\nI am a current UW-Madison graduate student in another program. Can I add/change to PMP?\nMore questions about Professional CS MS admissions? Contact us at pmp-admissions@cs.wisc.edu.\nBack to Top ↑\nMS Data Engineering FAQs\nData engineers ensure that increasing amounts of data being generated and processed on a daily basis are usable by the time they reach data scientists and analysts. This program prepares students for employment in this exponentially growing field.\nThe MS Data Engineering (MSDE) program focuses on the principles and practices of managing data at scale. It emphasizes the valid and efficient collection, storage, management, and processing of datasets to support computation and data driven systems important to data science and data analytics functions. Given the increasing amounts of data being generated and processed daily, almost all industries need data engineers to build and maintain robust data-handling systems. If you’re interested in making high-quality data accessible to scientists and analysts, this degree is for you.\nAdmit Term: Fall semester only\nApplication Deadline: February 15\nSTEM Program: Yes\nThis is an accordion element with a series of buttons that open and close related content panels.\nExpand all\nCollapse all\nWhat is the difference between the MS Data Engineering and MS Data Science programs?\nWhen are admissions decisions made, and how are applicants notified?\nMust I be a working professional or have professional experience to apply to MSDE? Will my professional experience be taken into consideration with my application?\nIs funding available for this program?\nCan I apply for MSDE and another program in the Department of Computer Sciences?\nWhat guidance do you have for my statement of purpose?\nHow long does it take to complete the MSDE program? Do you offer many courses in the evening?\nCan I do an internship during the MSDE program?\nHow does course advising work?\nCan admitted students pursue another graduate program with MSDE?\nI am a current UW-Madison graduate student. Can I add/change to MSDE?\nMore questions about MS Data Engineering admissions? Contact us at csdataeng@cs.wisc.edu.\nBack to Top ↑\nMS Data Science Info\nThe MS Data Science program is a joint professional program between the Statistics and Computer Sciences Departments and is administered by the Statistics Department. The program provides students with abilities in computational and statistical thinking and skills, which may be combined with domain knowledge to address data-rich problems from diverse fields and various industries. Graduates will acquire data science competencies to think critically about data, and to manage, process, model and analyze data to obtain meaning and knowledge, and further to use data in responsible, ethical ways. The curriculum addresses emerging, and rapidly growing areas of applied statistical and computing research and practice. Graduates seek employment as data analysts and data scientists or pursue further education in data science, statistics, computer science, or related quantitative and computational fields.\nAdmit Term: Fall semester only\nApplication Deadline: February 15\nBack to Top ↑\nProfessional Capstone Certificate Info\nIf you have obtained a bachelor’s degree that is not in computer science, but you now want to learn the fundamentals of computer science so you can transition toward a developer job or advance in your field, the Professional Capstone Certificate Program is for you. Students generally use this program to gain programming skills to transfer into a more technical position, for promotion, or as a way to prepare for a graduate program like the Professional Master’s Program. This popular program has welcomed students from many companies in the Madison metropolitan area.\nAdmit Terms: Fall, Spring, and Summer\nApplication Deadlines:\nFall Deadline: June 1\nSpring Deadline: October 15\nSummer Deadline: February 15\nBack to Top ↑\nUser Experience Design Capstone Certificate Info\nUser Experience Design Capstone Certificate is a joint program between the Computer Sciences Department and the Information School and is administered by the Information School. Students gain introductory through intermediate user experience skills to plan, design, and assess innovative digital user experiences via digital applications and media. You can complete the certificate entirely online, within one calendar year allowing for balance of your education, work and life.\nBack to Top ↑\nSITE FOOTER CONTENT\nUniversity logo that links to main university website\nPart of the Universities of Wisconsin\nQUICK LINKS\nComp Sci Courses\nIndustrial Affiliates Program\nIT Services\nMake a Gift\nEMAIL CONTACTS\nCS Undergraduate Advising – current students\nCS Prospective Undergraduates\nUW-Madison Undergrad Admissions\nUndergrad International Admissions\nCS Graduate Admissions Emails\nCS MS/PhD Coordinator\nCS PMP Coordinator\nCS Capstone Coordinator\nOther CS Contacts\nCONTACT US\n1210 W. Dayton Street\nMadison, WI 53706-1613\nMap map marker\nPhone: 608-262-1204\nfacebook x twitter linkedin\nWebsite feedback, questions or accessibility issues: feedback@cs.wisc.edu | Learn more about accessibility at UW–Madison.\nThis site was built using the UW Theme | Privacy Notice | © 2025 Board of Regents of the University of Wisconsin System.",
        "tags": [
            "cs",
            "2025",
            "ms",
            "university_of_wisconsin–madison"
        ]
    },
    {
        "id": "unc_chapel_hill",
        "title": "UNC Chapel Hill - MSCS Deadlines",
        "text": "This website uses cookies and similar technologies to understand visitor experiences. By using this website, you consent to UNC-Chapel Hill's cookie usage in accordance with their Privacy Notice.\nI Accept\nskip to the end of the global utility bar\nTHE UNIVERSITY of NORTH CAROLINA at CHAPEL HILL\nAccessibility\nEvents\nLibraries\nMaps\nDepartments\nConnectCarolina\nUNC Search\nAbout\nResearch\nGraduate\nUndergraduate\nStudent Life\nNews\nEngage\nHome / Graduate / Admission to Graduate Programs / Admissions Deadline\nAdmissions Deadline\nFor updated and detailed admissions deadline information, visit gradschool.unc.edu/programs/#494\nThe UNC Graduate School offers a select number of fellowships to PhD and MS graduate students in Computer Science. To receive full consideration for these fellowships, we recommend you submit your application by December 10, 2024.  To receive full consideration for a Research Assistantship (RA) or a Teaching Assistantship (TA) from the Computer Science department, we recommend you submit your application by January 9, 2025. The deadline to submit your application to the UNC Graduate School to be considered for admission to the PhD and MS programs in Computer Science is March 11, 2025.\nEarly submission of applications is encouraged and recommended. The deadlines apply to all applicants, including domestic and international applicants. Supplemental materials, such as recommendation letters and/or test scores, can come in after any deadline. The applicant’s part of the application should be completed and submitted by the deadline, including the application fee. The department cannot view applications until the application fee is paid.\nReport a Website Issue\nInternal Resources\nUNC ITS Help Desk\nUNC.edu\nLog In\nABOUT\nNews\nEvents Calendar\nQUICK LINKS\nUniversity Academic Calendars\nCourse Schedules\nCareer Services\nCONTACT\nThe Department of Computer Science\nBrooks Computer Science Building\n201 S. Columbia St. CB 3175\nUNC-Chapel Hill\nChapel Hill, NC 27599-3175\n\nPhone: 919-590-6000\nFax: 919-590-6105\nEmail: info@cs.unc.edu\nConnect with CS\nGIVE\nNEWSLETTER\n© 2025 Computer Science",
        "tags": [
            "cs",
            "2025",
            "ms",
            "unc_chapel_hill"
        ]
    },
    {
        "id": "northwestern_university",
        "title": "Northwestern University - MSCS Deadlines",
        "text": "NORTHWESTERN ENGINEERING\nABOUT\nACADEMICS\nRESEARCH & FACULTY\nOFFICES & SERVICES\nPage Not Found\nWe're sorry. The page you were looking for cannot be found. The page may have been removed or renamed, or may temporarily be unavailable.\nCommon causes of this error message include:\nAn incorrect or outdated link on one or more referral pages\nAn outdated link in a search engine index\nAn outdated bookmark\nA typographical error when entering the URL\nWe apologize for any inconvenience this may have caused you.\nWhat to Do Next\nYou might try searching our website using our search tool on this page to find what you're looking for.\nIf you choose, you may also report this error to the webmaster. Upon receipt of your message, we will investigate the problem thoroughly.\nBACK TO TOP\nCONTACT INFO\nRobert R. McCormick School of Engineering and Applied Science\nNorthwestern University\n2145 Sheridan Road  \nEvanston, Illinois 60208\nPhone: 847-491-5220\nFax: 847-491-8539\nNorthwestern Seal\nMcCormick School of Engineering,  Northwestern University\nTechnological Institute, 2145 Sheridan Road, Evanston, IL 60208view all contact info\nAdmissionsFaculty DirectoryGive to McCormickTech Room Finder / MapsEmergency InformationNorthwestern HomeTech Lost and FoundReport an Accessibility Issue\nMcCormick on twitterMcCormick on facebookMcCormick on linkedinMcCormick on instagramMcCormick on youtube\n©   Robert R. McCormick School of Engineering and Applied Science, Northwestern University  Disclaimer",
        "tags": [
            "cs",
            "2025",
            "ms",
            "northwestern_university"
        ]
    },
    {
        "id": "duke_university",
        "title": "Duke University - MSCS Deadlines",
        "text": "Skip to main\nInformational\nAttending the 2025 Hooding Ceremony on May 10? Some departments have moved to the morning ceremony. Review the updated schedule\nAction menu\nMake A Gift\nUtility menu\nApplicants\nStudents\nAlumni\nFaculty & Staff\nContact\nPolicies and Forms\nPrimary navigation\nAbout\nAcademics\nAdmissions\nFinancial Support\nStudent Life\nProfessional Development\nEvents\nM.S. in Computer Science\nM.S. in Computer Science\nGENERAL INFO\nFaculty working with students: 37\nStudents: 80\nStudents receiving Financial Aid: None available for M.S.\nApplication terms: Fall\nApplication deadlines: February 3\nAPPLICATION INFO\nCONTACT\nXiaowei Yang\nDirector of Graduate Studies\nDepartment of Computer Science\nDuke University\nBox 90129\nDurham, NC 27708-0129\nPhone: (919) 660-6500\nEmail: dgs@cs.duke.edu\nWebsite: http://www.cs.duke.edu\nPROGRAM DESCRIPTION\nThe Department of Computer Science offers programs leading to the M.S. and Ph.D. The M.S. program consists of a coursework--only option (30 credits) or a thesis or project option under the supervision of a faculty advisor and committee, culminating in a report and oral defense. The M.S. requires advanced courses in computer science and related fields. The M.S. program has optional concentrations in Cybersecurity and Artifical Intelligence/Machine Learning. Students should consult the departmental document Computer Science Graduate Program Degree Requirements for a full description of degree requirements.\nA student entering graduate study in computer science should have a strong undergraduate grounding in the fundamentals of calculus and discrete mathematics, and basic knowledge of data structures, algorithms, and one or more higher-level computing programming languages.\nThe research activities of the department’s faculty provide exciting and challenging research opportunities to students in computer science. The department has strong research programs in algorithms and computational complexity; computational geometry; internet systems, networking and security; computer architectures and distributed systems; computational biology; biological computing and nanotechnologies; databases, mobile, and cloud computing; machine learning theory and applications; and artificial intelligence, computational economics, computer vision, natural language processing, and scientific computing. Research in computer science overlaps with research areas in other disciplines including biology, engineering, nanotechnology, environmental sciences, economics, biochemistry, statistics, and medicine.\nSTATISTICS\nComputer Science: Master's Admissions and Enrollment Statistics\nComputer Science: Master's Career Outcomes Statistics\nAPPLICATION INFORMATION\nApplication Terms Available: Fall\nApplication Deadlines: February 3\nGraduate School Application Requirements\nSee the Application Instructions page for important details about each Graduate School requirement.\nTranscripts: Unofficial transcripts required with application submission; official transcripts required upon admission\nLetters of Recommendation: 3 Required\nStatement of Purpose: Required\nRésumé: Required\nGRE Scores: \nM.S.: GRE General Required\nEnglish Language Exam: TOEFL, IELTS, or Duolingo English Test required* for applicants whose first language is not English\n*test waiver may apply for some applicants\nGPA: Undergraduate GPA calculated on 4.0 scale required\nWriting Sample\nNone required\nWe strongly encourage you to review additional department-specific application guidance from the program to which you are applying: Departmental Application Guidance\nAPPLY\nList of Graduate School Programs and Degrees\nThe Graduate School\nThe Graduate School\n2127 Campus Drive\nDurham, NC 27708\n(919) 681-3257\nCONTACT US\nMAKE A GIFT\nCopyright © 2025 Duke University\nAccessibility\nPrivacy Statement",
        "tags": [
            "cs",
            "2025",
            "ms",
            "duke_university"
        ]
    },
    {
        "id": "brown_university",
        "title": "Brown University - MSCS Deadlines",
        "text": "Brown University\nGraduate Programs\nSearch\nMenu\nComputer Science\nSc.M.\nRequest More Info\nNote, if you are a current Brown undergraduate interested in the Fifth-Year Master's Program, please fill out this inquiry form.\nFirst Name*\nPreferred/Chosen First Name\nLast Name (Family Name/Surname)*\nEmail Address*\nMobile Phone Number\nAre you a US Citizen or Permanent Resident?*\nUS Citizen\nPermanent Resident\nNone of the Above\nAnticipated Entry Year\n2025\n2026\nBy completing this form, you agree to receive communications from the School of Professional Studies at Brown University and allow your data to be stored. Brown University will never sell your email address or other information to a third party. All communications will include the opportunity to unsubscribe.\nSUBMIT\nDEPARTMENT\nComputer Science\nALL GRADUATE PROGRAMS\nNavigate This Page\nAbout the Program\nApplication Information\nTuition and Funding\nCompletion Requirements\nAlumni Outcomes\nLeadership\nContact and Location\nBrown University’s two-year, on-campus master's in computer science is your gateway to mastering cutting-edge fields such as AI, robotics, machine learning, visual computing, software and systems.\nWhether you’re looking to improve your professional expertise in computer science or prepare for further graduate study, the on-campus master’s in computer science program offers personalized coursework, groundbreaking research projects and real-world experience – all taught by renowned professors in a vibrant and innovative environment.\nThis program offers the following degree with two options:\nMaster of science (Sc.M.)\nCoursework-only\nResearch project\nEither option may be completed as part of the professional track, in which you must complete a two to six month internship.\nTaught by distinguished professors who have established the department's reputation for innovative education and cutting-edge research, the curriculum spans a wide array of computer science disciplines, including: artificial intelligence/machine learning, computational biology, computer architecture, data, design, security, software principles, systems, theory and visual computing.\nHighly customizable, this program allows you to tailor your studies to match your particular ambitions and experiences through pathways. You can choose coursework that provides a broad, advanced learning experience across several computer science disciplines or you can more narrowly focus on one area of specialization based on your objectives.\nAdditional Information\nThe Department of Computer Science provides leading-edge computing technology to all students. Each student has access to a shared computer science department office equipped with desktop computers and docking stations. In addition, students have access to all our research labs.\nBrown undergraduates can apply to this program as a fifth-year master's degree.\nATTEND AN INFO SESSION\nApplication Information\nThere are exceptions, but typically we look for outstanding students who already have an undergraduate CS degree or the equivalent and are ready to take our Master's-level courses. While we sometimes discount weaknesses in some areas if there are strengths in others, we'd like to see most of the following courses:\nAn introductory Programming course\nAn introductory Algorithms and Data Structures course\nA Computer Systems or a Software Engineering course (preferably both)\nA course on Discrete Mathematics and basic Probability\nA Linear Algebra course\n In addition, a student should have taken a more advanced course (normally offered to juniors and seniors) in at least one area of CS.\nApplication Requirements\nGRE Subject:\nNot required\nGRE General:\nNot required, but score submission is encouraged.\nTOEFL/IELTS:\nRequired for any non-native English speaker who does not have a degree from an institution where English is the sole language of instruction or from a University in the following countries: Australia, Bahamas, Botswana, Cameroon, Canada (except Quebec), Ethiopia, Ghana, Ireland, Kenya, Lesotho, Liberia, Malawi, New Zealand, Nigeria, Zimbabwe, South Africa, Sierra Leone, Swaziland, Tanzania, Gambia, Uganda, United Kingdom (England, Scotland, Northern Ireland, Wales), West Indies, Zambia).\n\nThe TOEFL iBT Special Home Edition and the IELTS Indicator exam are accepted.\n\nStudents from mainland China may submit the TOEFL ITP Plus exam\n\nThe minimum TOEFL score is 105 and the minimum IELTS score is 8.0.\n\nOfficial Transcripts:\nRequired. All applicants may upload unofficial transcripts for application submission. Official transcripts are ONLY required for enrolling students before class start. An international transcript evaluation (WES, ECE, or The Evaluation Company) is required for degrees from non-U.S. institutions before enrollment.\n\nApplicants who are currently enrolled in an undergraduate program should plan to submit their fall semester grades as a part of their application for fullest consideration. If the application deadline passes before fall grades are available, please provide a copy of your in progress coursework if it is not included on your transcript and plan to follow up with grades when they are made available. We also encourage you to provide your in progress coursework for the spring semester, if available.\nLetters of Recommendations:\nThree (3) letters of recommendation required for external applications. Brown undergraduates considering the fifth-year master's degree option should submit two (2) letters of recommendation.\n\nRecent graduates (within 3 years) and current students should provide at least 2 letters of recommendation from professors who can speak to your coursework in Computer Science.\nResume/CV:\nRequired\nAdditional Requirements:\nIf you have any questions regarding the application process for this program, please email masters_admissions@brown.edu.\nDates/Deadlines\nAPPLICATION DEADLINE\nJanuary 15, 2025\n5TH YEAR DEADLINE\nMay 1, 2025\nTuition and Funding\nGraduate Tuition & Fees: Please visit the Office of Student and Financial Services for up-to-date tuition rates.\nScholarships: A limited number of full-tuition scholarships are available to those who answer the optional question in the CS application. Graduate and Teaching Assistantships are not available. Learn more about master’s funding from the Office of Financial Aid.\n  Completion Requirements\nAll students will complete a two-course specialization in one of ten approved areas or Pathways. The remaining six required courses consist of four CS or closely-related courses plus either two courses in which work is towards completion of a research project or two graduate-level CS courses. Students must have a B average over all courses used to satisfy the requirements. All courses must be taken for a grade, and all grades must be C or better (S's may not be used).\nAlumni Outcomes\nOur recent master's graduates hold positions such as senior software developers, ML/AI engineers, data scientists and product managers at established companies and startups across a variety of industries.\nLEARN MORE\nLeadership\nContact and Location\nDepartment of Computer Science\nMailing Address\nBrown University\nBox 1910\ncs-masters-info@brown.edu\n401-863-7600\nVISIT THE DEPARTMENT OF COMPUTER SCIENCE\nResources\nProgram Faculty\nProgram Handbook\nGraduate School Handbook\nProgram FAQ's\nBROWN UNIVERSITY\nProvidence RI 02912\n401-863-1000\nQuick Navigation\nVISIT BROWN\nCAMPUS MAP\nA TO Z\nCONTACT US\nFooter Navigation\nNEWS\nEVENTS\nCAMPUS SAFETY\nACCESSIBILITY\nCAREERS AT BROWN\nGIVE TO BROWN\n© Brown University",
        "tags": [
            "cs",
            "2025",
            "ms",
            "brown_university"
        ]
    },
    {
        "id": "university_of_florida",
        "title": "University of Florida - MSCS Deadlines",
        "text": "Skip to main content\nUniversity of Florida\nComputer & Information Science & Engineering\nHOME\nABOUT\nRESEARCH\nACADEMICS\nADMISSIONS\nPEOPLE\nNEWS & EVENTS\nRESOURCES & HELP\nHERBERT WERTHEIM COLLEGE OF ENGINEERING\nCISE CAREER FAIR\nGIVING\nALUMNI & FRIENDS\nUF ADMISSIONS\nDIRECTORY\n**FACULTY OPENINGS**\nFACEBOOK\nTWITTER\nYOUTUBE\nLINKEDIN\nINSTAGRAM\nWelcome\nSearch\nSubmit\nSearch\nJOIN OUR TEAM ASSISTANT/ASSOCIATE/FULL PROFESSOR - COMPUTER & INFORMATION SCIENCE & ENGINEERING\nMORE INFORMATION\nHome\nAcademics\nGraduate\nMaster’s Program\nMASTER’S PROGRAM\nCOURSE SYLLABI\nLABS & CONFERENCE ROOMS AVAILABILITY\nGRADUATE\nGraduate Student Welcome\nEthics & Code of Conduct\nTeaching Assistant (TA) Appointment Procedures\nCourse Information\nGraduate Certificate\nMaster’s Program\nPh.D. Program\nPh.D. Minor\nHuman-Centered Computing\nUNDERGRADUATE\nACADEMIC ADVISING\nCISE CAREER FAIR\nThe CISE Career Fair is a biannual event held by the department for students and alumni with experience in computer science and computer engineering to interact with top-industry companies in a professional setting. All students are encouraged to attend.\nLearn More …\nMaster’s Degree Overview\nMaster’s Degree General Requirements\nMaster’s Supervision\nCourse and GPA Requirement\nMaster’s Examination\nApplying to Enter the Ph.D. Program for CISE Master’s Students\nProgress Toward the Master’s Degree\nChecklist for Master’s Degree (PDF)\nMaster’s Minor\nMASTER’S DEGREE OVERVIEW\nThe CISE Department offers the Master of Science degree through the Herbert Wertheim College of Engineering:\nM.S. in Computer Engineering\nM.E. in Computer Engineering\nM.S. in Computer Science\nTo review tuition and fee costs and comparisons, please visit the Office of Student Financial Aid and Scholarships.\nMASTER’S DEGREE GENERAL REQUIREMENTS\nCourses numbered 7979 and 7980 are not eligible to count toward a master-level degree program.\nMaster’s students may choose between the thesis and the non-thesis options. The total credit hours required for either option are 30. Up to 9 credits earned from another accredited institution may be transferred and must be applied during the first term of enrollment. For the thesis option, 6 credits of CIS 6971 are required and counted towards the 30-credit requirement. The student should choose one option when the supervisory committee is formed, and any subsequent change in option is subject to approval by the supervisory committee. The Graduate School requires that any change in option be completed at least one full semester prior to the intended date of graduation. (Note that once a student has taken the master’s examination or has attempted a thesis defense, the option cannot be changed.)\nA student seeking a Master’s degree in the College of Engineering may become a candidate for the Master of Engineering degree, provided the student has a bachelor’s degree in engineering from an ABET-accredited program or has taken sufficient engineering core coursework to meet the minimum requirements specified by ABET. Students who do not meet this requirement will be candidates for the Master of Science degree.\nMASTER’S SUPERVISION\nEvery entering M.S. graduate student should attend the New Student Orientation, usually given right before or at the beginning of Fall and Spring semester. The Graduate Advisor provides general advisement for all new students upon entering the graduate program.\nIf the thesis option is chosen, the student must form a supervisory committee no later than the end of the second semester of enrollment. The committee chairman henceforth becomes the student’s advisor. The student should consult the advisor for advice in creating and pursuing a plan of study. The supervisory committee must comprise of at least two members (including the committee chair).\nCOURSE AND GPA REQUIREMENTS\nAll Master’s students must satisfy core and elective course requirements. The course requirement varies for each Master’s degree program. Transferring any core course from outside of CISE to satisfy any course requirement must be approved by the Graduate Affairs Committee (see “Establishing Equivalencies for Core Courses” below).\nAccording to Graduate School rules, students must maintain a 3.0 overall GPA, as well as a cumulative 3.0 GPA for all courses taken from CISE, to graduate.\nThe only passing grades for graduate students are A, A-, B+, B, B-, C+, C, and S.\nThe Computer and Information and Engineering department does not allow graduate students to take undergraduate courses (3000-4999).\nCourses numbered 5000 and above are limited to graduate students, with the exception described under Undergraduate Registration in Graduate Courses. Courses numbered 7000 and above are normally for advanced graduate students.\nACADEMIC PROBATION\nStudents are expected to make satisfactory progress toward degree completion. Failure to maintain a 3.0 GPA will result in a student being placed on academic probation. Students on probation cannot hold assistantships or fellowships and must resolve their GPA deficit within two semesters. Failure to do so will result in dismissal from the degree program.\nConsult the UF CISE Policy on Unsatisfactory Progress or Unsatisfactory Scholarship for further details.\nCOURSE AND CREDIT REQUIREMENTS\nThrough the Herbert Wertheim College of Engineering\nM.S. in Computer Engineering\n\nM.E. in Computer Engineering\n\n\nM.S. in Computer Science\n\n\nESTABLISHING EQUIVALENCIES FOR CORE COURSES\nIf you believe that you have taken a course, including undergraduate coursework that is equivalent to a graduate-level core course in our department, you will need to:\nObtain a copy of your complete final transcript from your prior institution.\nPrepare a copy of the course syllabus and catalog description of the equivalent course as well as any supporting material such as exams, projects, and homework.\nBring these items and a completed Equivalency Form to the instructor who teaches the core course for an equivalency decision.\nEmail the completed form to Adrienne L. Cook at alcook@ufl.edu.\nNote: The equivalency process differs from the process of either transferring your degree or transferring credits toward your degree. The transfer of credit process may be initiated with the graduate academic advisor after the third week of classes.\nTRANSFER OF CREDIT\nOnly graduate-level courses, earned with a grade of B or better (a B- does not count), may be transferred from an institution approved for this purpose by the Graduate School. Transfer of credit may be considered from course work taken while holding a classification level of 0 (non-degree seeking), 6 (postbaccalaureate), 7, 8, or 9 . Transfer course work must be taken within the 7 years immediately preceding the date the degree is to be awarded for non-doctoral degrees. Courses with “P” or “S” grading cannot be transferred. Masters See the “Transfer of credit” subheading under “Requirements for Master’s Degrees” and then “General Regulations for Master’s Degrees” at https://gradcatalog.ufl.edu/graduate/degrees\nMASTER’S EXAMINATION\nAll Master’s students are required to pass an examination within six months prior to graduation. Students must be appropriately registered in their final term (three credit hours for Fall and Spring semesters and two credit hours for Summer semesters. Students with thesis option must register for three credits of CIS 6971 Master’s Research in the final term. A graduation workshop is held every semester for graduating students to review graduation requirements.\nStudents with thesis option are examined primarily on their thesis topic. The scope of the thesis will be determined by the student’s supervisory committee. Each student must request that the oral examination be scheduled, in concurrence with the Supervisory Committee Chair. The examination announcement must be posted by the Student Services Center a minimum two weeks prior to the examination. Committee members must be provided a copy of the thesis one week prior to the examination.\nNon-thesis option students are given a brief written examination after they have satisfied all course and grade requirements. The exam requires general computer science engineering knowledge and may be administered in conjunction with the Exit Interview. Questions regarding the exam and/or Exit Interview should be directed to a graduate advisor.\nAPPLYING TO ENTER THE PH.D. PROGRAM FOR CISE MASTER’S STUDENTS\nCISE Master’s students may apply to enter the Ph.D. program. A statement of purpose and three reference letters from CISE graduate faculty are required. The student’s graduate record will be reviewed and evaluated by the admissions committee for entry into the Ph.D. program.\nAll Master’s-to-Ph.D. decisions will be made in the early spring for the fall semester entry date. All materials should be submitted to the grad admissions officer at the Student Services Center before February 1.\nPROGRESS TOWARD THE MASTER’S DEGREE\nAll requirements for the Master’s degree shall be completed within seven years after enrollment. Full-time students are expected to finish their requirements within three years. If a student fails to do this, a decision will be made by the Graduate Affairs Committee as to whether the student should continue in the program. The decision is based on a recommendation by the student’s advisor as well as on each student’s progress towards the completion of the master’s degree.\nMASTERS MINOR\nTo obtain a Master’s minor, a non-CISE student earning a Master’s in another department must complete one systems area graduate core course, one theory area graduate core course, and one elective graduate course, each with a grade of B or better. In addition, the Graduate Coordinator will serve as a minor representative on a Master’s committee of the major department. See information sheet.\nSYSTEMS CORE COURSES:\nCDA 5155 Computer Architecture Principles\nCNT 5106C Computer Networks\nCOP 5556 Programming Language Principles\nCOP 5615 Distributed Operating System Principles\nTHEORY CORE COURSES:\nCOP 5536 Advanced Data Structures\nCOT 5405 Analysis of Algorithms\nCOT 6315 Formal Languages and Computation Theory\nAPPLY\nGIVE\nNEWS\nEVENTS\nUniversity of Florida\nFACEBOOK\nTWITTER\nYOUTUBE\nLINKEDIN\nINSTAGRAM\nDepartment of Computer & Information Science & Engineering\n1889 Museum Road,\nP.O. Box 116120,\nGainesville, FL 32611\nStudent Services: p. 352-392-1090\nAdministrative Office: p. 352-392-1200\nUF RESOURCES\nUF NEWS\nUF CALENDAR\nMYUFL\nONE.UF\nDIRECTORY\nCAMPUS\nWEATHER\nCAMPUS MAP\nSTUDENT TOURS\nACADEMIC CALENDAR\nEVENTS\nWEBSITE\nUF WEBSITE LISTING\nACCESSIBILITY\nTEXT-ONLY VERSION\nPRIVACY POLICY\nREGULATIONS",
        "tags": [
            "cs",
            "2025",
            "ms",
            "university_of_florida"
        ]
    }
]